{
  "https://timesofindia.indiatimes.com/sports/paris-olympics-2024/indiaparis/from-tokyos-heartbreak-to-historic-triumphs-in-paris-manu-bhaker-says-let-the-past-remain-in-the-past/articleshow/112134270.cms": {
    "name": "From Tokyo's heartbreak to historic triumphs in Paris - Manu Bhaker says 'let the past remain in the past'",
    "articleBody": "NEW DELHI: Indian shooter Manu Bhaker made history on Tuesday by becoming the first Indian to win two medals at the same Olympics post-Independence, securing her second bronze in the 10m air pistol mixed team event alongside Sarabjot Singh. This achievement comes after Bhaker had already secured a bronze medal in the women's 10m air pistol event, marking a significant milestone in her shooting career.Live Updates: Paris Olympics Day 4Bhaker, 22, had earlier faced disappointment due to a malfunction of her pistol during the Tokyo Olympics. She has now redeemed herself with stellar performances in Paris. 112131506Reflecting on her journey since Tokyo, Bhaker remarked, \"After Tokyo, I was very disappointed, and how the events turned out to be for me were not very good. It took me a long time to overcome that. However, I came back stronger. So what is now is what matters. Let's just let the past remain in the past.\"&mdash; JioCinema (@JioCinema) Bhaker and Singh showcased a composed partnership to triumph in the 10m air pistol mixed team event, defeating the Korean duo of Lee Wonoho and Oh Yeh Jin with a score of 16-10. This victory brought India its second medal at Chateauroux's shooting range.In her previous event at the same venue, Bhaker secured a bronze medal in the women's 10m air pistol, eliminating the bitter memories of her Olympic debut in Tokyo 2020. 112132679Before Bhaker, British-Indian athlete Norman Pritchard had won two silver medals in the 200m sprint and 200m hurdles at the 1900 Olympics, a feat that occurred during the pre-Independence era.Sarabjot Singh also experienced a form of redemption after narrowly missing the men's 10m air pistol final, finishing ninth with a score of 577.Expressing her pride and gratitude after the match, Bhaker said, \"I'm feeling really proud, and there is a lot of gratitude, thanks for all the blessings.\" 112132911Elaborating on their strategy, she added, \"Actually we can't control what the rivals will do, we can do what is in our hand. Me and my partner thought, let's just try our best and we will keep fighting till the end.\"Sarabjot Singh, hailing from a farming family in Ambala, admitted to feeling immense pressure. \"I'm feeling good, the game was very tough and there was a lot of pressure. I am very happy,\" said the 22-year-old.This historic achievement underscores Bhaker's resilience and marks a significant milestone for Indian sports, particularly women's sports in the country. Both young shooters have set a new benchmark, inspiring many with their determination and excellence.",
    "articleSummary": "Manu Bhaker becomes first Indian to win two medals at the same Olympics post-Independence. Bhaker and Sarabjot Singh win bronze in the 10m air pistol mixed team event. This victory brought India its second medal at Chateauroux's shooting range."
  },
  "https://timesofindia.indiatimes.com/city/chandigarh/haryana-congress-rift-widens-as-selja-emerges-as-cm-face-in-posters/articleshow/112121419.cms": {
    "name": "Kumari Selja â\u0080\u0098CM faceâ\u0080\u0099 in Haryana Congress posters, rift with Hooda faction widens",
    "articleBody": "CHANDIGARH: The rift between the Bhupinder Singh Hooda and SRB (Sirsa MP Selja, Rajya Sabha MP Randeep Surjewala, and former Union minister Birender Singh) factions of the Haryana Congress has widened after the Lok Sabha elections despite encouraging results, and the poster war for chief ministerial face has made it worse.112132441Seeing the senior Hooda and his son (Lok Sabha MP Deepender Hooda) hold workersâ\u0080\u0099 meetings and run â\u0080\u0098Hisab Doâ\u0080\u0099 campaign with state Congress president Udai Bhan against the stateâ\u0080\u0099s BJP govt, Sirsa MP Selja has intensified her Sandesh Yatra. While team Hooda refrains from commenting against her or her groupâ\u0080\u0099s dissenting views, four of the five new MPs of the party from the state â\u0080\u0094 Deepender Hooda, Jai Parkash, Satyapal Brahmchari, and Varun Choudhary â\u0080\u0094 endorse the senior Hooda as their leader. Seljaâ\u0080\u0099s group projects her as CM face in its meetings and has activated its teams in mobilising support for the Congress.Seljaâ\u0080\u0099s team has now released a poster of SRBâ\u0080\u0099s picture with the Congress high command that includes party president Malikkarjun Kharge, Lok Sabhaâ\u0080\u0099s leader of opposition Rahul Gandhi, and former party president Sonia Gandhi. It has omitted the names of Hooda, partyâ\u0080\u0099s political affairs in-charge for state Deepak Babaria, and Udai Bhan from this poster, but neither the state party leadership nor the AICC in-charge have spoken on it.Senior members of Seljaâ\u0080\u0099s group claim the posterâ\u0080\u0099s design and its projection of Selja as their personal choice. One of them said: â\u0080\u009cThe workers want her to occupy the top post, since a Congress victory is imminent in the assembly elections. We cannot question the workers.â\u0080\u009dHPCC president Udai Bhan dismissed the issue, saying: â\u0080\u009cIt doesnâ\u0080\u0099t matter. As long as she works for the party, promotes its symbol, and is loyal to the high command, the ultimate results will favour the Congress.â\u0080\u009d Selja, Surjwwala, and Birender Singh are Hooda familyâ\u0080\u0099s main detractors in the state. The groupâ\u0080\u0099s fourth member, Kiran Choudhry, quit the party last month.We also published the following articles recently Budget ignored Haryana, state will ignore BJP during polls: Deepender HoodaCongress MPs from Haryana protested in Parliament, accusing the government of neglecting their state in the Union Budget. Rohtak MP Deepender Hooda criticized Union minister Lalan Singh for dismissing their concerns, stating the people will similarly overlook the BJP in the upcoming Haryana assembly elections slated for October.112041350 MP Deepender Hooda will start the second phase of Haryana Mange Hisaab Abhiyan on 31st JulyDeepender Hooda, Lok Sabha MP from Rohtak, launched the second phase of Haryana Mange Hisaab Abhiyan on July 31, demanding accountability from the BJP government for its 10-year tenure. He plans to visit 56 assembly constituencies by August 30 to hold public meetings. Hooda's chargesheet includes questions on unemployment, inflation, corruption, and infrastructure failures.112086919 Union budget: Congress, Left parties to protest discrimination against some statesTamil Nadu Congress Committee planned protests across the state on Saturday, condemning the Centre's perceived discrimination in fund allocation highlighted in the Union budget. TNCC president K Selvaperunthagai stated that while Bihar and Andhra Pradesh received substantial amounts, Tamil Nadu received none despite generating significant GST revenue. Left parties also announced protests for similar grievances.112044551",
    "articleSummary": "TNCC president K Selvaperunthagai stated that while Bihar and Andhra Pradesh received substantial amounts, Tamil Nadu received none. Left parties also announced protests for similar grievances. Bhupinder Singh Hooda and SRB (Sirsa MP Selja, Rajya Sabha MP Randeep Surjewala, and former Union minister Birender Singh) factions of the Haryana Congress are at odds. Selja’s group projects her as CM face in its meetings and has activated its teams in mobilising support for the Congress."
  },
  "https://timesofindia.indiatimes.com/sports/paris-olympics-2024/indiaparis/who-is-sarabjot-singh-ace-shooter-who-won-indias-second-medal-with-manu-bhaker-at-paris-olympics/articleshow/112132911.cms": {
    "name": "Who is Sarabjot Singh, India's latest Olympic medallist",
    "articleBody": "NEW DELHI: Ace shooter Sarabjot Singh, who 'gave up football to pursue shooting', won India's second medal with Manu Bhaker at Paris Olympics when the duo won the 10m Air Pistol Mixed Team event bronze medal match against Korea 16-10.At the shooting range in Chateauroux, the Indian team defeated the Korean team of Lee Wonoho and Oh Yeh Jin 16â\u0080\u009310 to win the nation's second medal.Three days ago, Sarabjot, who had gone through a challenging time attempting to cope with the disappointment of losing the solo competition, said he felt a lot of pressure to do well.Sarabjot's first attempt for the Indians yielded a dismal 8.6, and Bhaker's shot of 10.2 resulted in an overall score of 18.8. With a total of 20.5, the Koreans won the first round and took a 2-0 lead.The team with the most pointsâ\u0080\u009416â\u0080\u0094wins the medal in mixed team competitions.At a deficit of 0â\u0080\u00932, Bhaker's reliability was evident, and Sarabjot benefited from it as they won the following four games to increase their lead to 8â\u0080\u00932.Bhaker was so confident that during the entire 13-round competition, she only had three shots below ten.The Koreans faced an uphill battle as they gave in to pressure and lost 16â\u0080\u009310, unable to equal their opponents.At 13 years of age, Sarabjot harboured hopes of becoming a footballer but while studying at Ambala's Bhagirath Public School, he saw a few kids wielding air guns at a makeshift range during a summer camp and went to his father and told him that he wants to pursue shooting.That was 2014. Sarbjot's father Jitender Singh, a farmer, told his son that the sport is pretty expensive. But eventually, after Sarabjot insisted for months, he agreed.It's a decision that the family will never repent, especially after what Sarabjot has achieved in the international circuit.&mdash; narendramodi (@narendramodi) Sarabjot has already won a senior ISSF World Cup gold in 10m air pistol.In the domestic circuit, his precision and calmness has made him the national champion twice.As of now, Sarabjot has won 2 World Championships gold medals, 3 World Cup gold medals, 1 ISSF Junior World Cup gold, 1 gold and 2 silver medals in ISSF Junior Cup and 2 gold medals, a sliver and a bronze in the Asian Championships.Sarabjot has always credited his coach Abhishek Rana for making a champion out of him.",
    "articleSummary": "Sarabjot Singh won India's second medal with Manu Bhaker at Paris Olympics. The duo won the 10m Air Pistol Mixed Team event bronze medal match against Korea 16-10. At 13 years of age, Sarbjot harboured hopes of becoming a footballer."
  },
  "https://timesofindia.indiatimes.com/technology/tech-news/techie-loses-rs-28-lakh-to-dating-scam-police-reveals-how-he-was-trapped/articleshow/112127210.cms": {
    "name": "Techie loses Rs 28 lakh to dating scam; police reveals how he was trapped",
    "articleBody": "An engineering graduate in Visakhapatnam fell victim to a sophisticated online dating scam, losing over Rs 28 lakh. The victim, an unmarried mechanical engineer, was targeted by cyber crooks who created fake profiles on dating websites and apps to develop romantic relationships with unsuspecting individuals.How the techie was trappedInvestigations revealed that the engineer was ensnared by a well-orchestrated scam involving a fake online profile. The fraudsters, operating from Telangana, skillfully manipulated the victim's emotions, convincing him to transfer large sums of money under various pretexts. The police have identified one member of the gang, Kommagoni Lokesh, and are on the lookout for the other two accomplices.â\u0080\u009cThis dating scam is a new type of fraud where cyber crooks create fake profiles, featuring attractive women, on dating websites or apps to trap gullible men. Once a contact is established with the potential victims, the imposter engages in frequent and intimate communication to build trust and emotional connection with them,â\u0080\u009d Cybercrimes police station inspector K Bhavani Prasad, told TOI.â\u0080\u009cThereafter, the cybercrooks devise a fascinating story to seek money. Besides extorting money through fake narratives, the fraudsters also blackmail their victims by threatening to make public their personal information and compromising photos shared during the relationship. We have received complaints from some of the victims, who have lost good amounts of money in the fraud,â\u0080\u009d added Prasad. Tips to stay safe from online romance scamsScammers often create a sense of urgency to rush you into a committed relationship.Use reverse image search to confirm the authenticity of profile pictures. Be cautious about sharing personal information.Never send money to someone you've only met online, regardless of the reasonSet clear boundaries and avoid sharing sensitive information, such as your financial details or address.If something feels off, it probably is. End communication immediately if you suspect a scam.Stay informed about common romance scams and how to identify them.Be cautious of people who claim to be from overseas or unable to meet in personIf you decide to meet, choose a public place and inform a friend or family member of your plans.",
    "articleSummary": "An engineering graduate in Visakhapatnam fell victim to a sophisticated online dating scam, losing over Rs 28 lakh. The victim, an unmarried mechanical engineer, was targeted by cyber crooks who created fake profiles on dating websites and apps to develop romantic relationships with unsuspecting individuals."
  },
  "https://timesofindia.indiatimes.com/sports/paris-olympics-2024/indiaparis/paris-olympics-2024-day-4-july-30-indias-full-schedule/articleshow/112115641.cms": {
    "name": "Paris Olympics 2024 Day 4 (July 30): India's Full Schedule & Results",
    "articleBody": "NEW DELHI: A confident Manu Bhaker won her second Olympic medal, as she and Sarabjot Singh beat Korea 16-10 in the bronze playoff for the 10m air pistol mixed team event. The Indian menâ\u0080\u0099s hockey team will face Ireland in their third pool match, while archers, shuttlers, and boxers will also be in action.Following is India's Day 4 schedule at the Paris Olympics on Tuesday (All timings in IST):Shooting12:30 PM: Prithviraj Tondaiman fails to qualify for final after finishing 21st in Trap Men's Qualification12:30 PM: Shreyasi Singh, Rajeshwari Kumari in Trap Women's Qualification - Day 11 PM: Manu Bhaker/Sarabjot Singh win bronze in 10m Air Pistol Mixed Team Bronze MedalRowing1:40 PM: Balraj Panwar finishes 5th in Men's Singles Sculls QuarterfinalsHockey4:45 PM: India vs Ireland in Men's Pool BArchery5:14 PM: Ankita Bhakat loses 4-6 to Wioleta Myszor (Poland) in Women's Individual 1/32 Elimination Round5:27 PM: Bhajan Kaur vs Syifa Nurafifah Kamal (Indonesia) in Women's Individual 1/32 Elimination RoundBadminton5:30 PM: Satwiksairaj Rankireddy/Chirag Shetty vs Alfian Fajar/Muhammad Rian Ardianto (Indonesia) in Men's doubles (Group stage)Archery5:53 PM: Bhajan Kaur in Women's Individual 1/16 Elimination Round (If qualified)Badminton6:20 PM: Ashwini Ponnappa/Tanisha Crasto vs Setyana Mapasa/Angela Yu (Australia) in Women's Doubles (Group stage)Boxing7:16 PM: Amit Panghal vs Patrick Chinyemba (Zambia) in Men's 51kg Round of 16Boxing9:24 PM: Jaismine Lamboria vs Nesthy Petecio (Philippines) in Women's 57kg Round of 32Archery10:46 PM: Dhiraj Bommadevara vs Adam Li (Czechia) in Men's Recurve Individual 1/32 Elimination Round11:25 PM: Dhiraj Bommadevara Men's Recurve Individual 1/16 Elimination Round (If qualified)Boxing1:20 AM: Preeti Pawar vs Yeni Marcela Arias (Colombia) in Women's 54kg Round of 16 112112545",
    "articleSummary": "Manu Bhaker wins her second Olympic medal as she and Sarabjot Singh beat Korea 16-10 in the bronze playoff for the 10m air pistol mixed team event. The Indian menâ\u0080\u0099s hockey team will face Ireland in their third pool match. Archers, shuttlers, and boxers will also be in action."
  },
  "https://timesofindia.indiatimes.com/sports/paris-olympics-2024/indiaparis/manu-bhaker-makes-history-with-second-bronze-at-paris-olympics/articleshow/112131506.cms": {
    "name": "Trailblazer Manu Bhaker first Indian to win two medals at same Olympics post-Independence",
    "articleBody": "NEW DELHI: Shooting sensation Manu Bhaker made more history on Tuesday, becoming the first Indian to win two medals in a single Olympics post-Independence. Manu, who had already made headlines by becoming the first woman shooter to win a medal with her bronze in the 10m air pistol individual event, added another bronze in the 10m air pistol mixed team event alongside Sarabjot Singh.Live Updates: Paris Olympics Day 4The duo triumphed over the Korean pair 16-10 in the bronze-medal match in Paris, securing India's second medal in the ongoing Summer Games. Manu can still make it a hat-trick of medals in Paris as she has the 25m Pistol event left to play, where she will participate alongside Esha Singh.This achievement marks a significant milestone in Indian sports history, with Manu setting multiple records. 112130992Records set by Manu Bhaker with her second bronze medalFirst Indian woman in 20 years, since Suma Shirur at the 2004 Athens Games, to enter an Olympic shooting final.First Indian woman shooter to win an Olympic medal.First Indian to win an Olympic medal in air pistol.First Indian to win two medals in the same edition of the Olympic Games post-Independence.First Indian shooter to win two Olympic medals.First Indian shooting pair (Manu Bhaker and Sarabjot Singh) to win a team medal in the Olympics.First Indian to win Olympic medals in both individual and team events.Rare ParallelsManu Bhaker is now only the second Indian woman, after badminton great PV Sindhu, to win two Olympic medals.This series of accomplishments underscores Manu's exceptional talent and dedication, making her a standout athlete in Indian sports history. As she continues to shine on the global stage, Manu Bhaker's achievements will inspire future generations of Indian shooters.",
    "articleSummary": "Shooting sensation Manu Bhaker becomes first Indian to win two medals in a single Olympics post-Independence. Bhaker added another bronze in the 10m air pistol mixed team event alongside Sarabjot Singh. The duo triumphed over the Korean pair 16-10 in the bronze-medal match in Paris."
  },
  "https://timesofindia.indiatimes.com/city/hyderabad/for-sc-sts-funding-iit-studies-is-tougher-than-cracking-jee/articleshow/112121042.cms": {
    "name": "For SC-STs, funding IIT studies is tougher than cracking JEE",
    "articleBody": "HYDERABAD: On August 1, when gates of IIT-Tirupati open, Bonila Aryan Roshan will be in queue of students heading to the chemical engineering department. Yet, Roshan is far from being ecstatic.\"I'm not sure if I'll be able to complete my four years of engineering,\" he says. Roshan, from SC community, belongs to Telangana's Siddipet district where his mother works as a daily wager for Rs 200 a day. The family has managed to raise Rs 50,000 to foot Roshan's IIT bills. \"It will see me through my first semester... not sure how I will pay for my education after that,\" said the 18-year-old who secured a 2406 rank (SC category) in JEE 2024. He lost his father at a young age.Roshan's story is the reality of several students from Telangana's marginalised communities. IITs waive tuition fee of Rs 1 lakh for SC/ST candidates. But they are expected to bear other costs such as accommodation, mess, and registration. That comes to anywhere between Rs 1 lakh and Rs 1.5 lakh annually. The cash-strapped students end up selling whatever little assets they have, or they are left at the mercy of philanthropists.Over the past few weeks, TOI wrote about three such students - Badavath Madhulatha (IIT Patna), Vasam Sushmitha (IIT Gandhinagar) and Kuncham Shiva (IIT Mumbai). All were on the verge of giving up their IIT dream. When their stories went public, Telangana government, politicians, corporates and individuals came forward to support their education.Roshan hopes for a messiah too, as does Bhukya Dyandeep of Mulugu dist. The tribal boy has secured a seat at IIIT Ranchi after counselling. But he is struggling to raise Rs 1.56 lakh for fee.Vinodh Kumar, a well-wisher with the handle @vinodhkuma45637 posted on X: \"They are from a very poor family. His father died 13 years ago, and his mother is working in a private school as an attendant. They are waiting for help.\"Vishnu (name changed), son of small-time farmers from Khammam, shares the tumultuous time his family had to endure after he got a seat at IIT Kharagpur three years ago. \"From selling our cattle to borrowing money, we exhausted all options to arrange Rs 1.3 lakh per year. It was in my third year that I managed to find a sponsor and study without the fear of having to drop out,\" said the final-year B Tech student.",
    "articleSummary": "IITs waive tuition fee of Rs 1 lakh for SC/ST candidates. But they are expected to bear other costs such as accommodation, mess, and registration. The cash-strapped students end up selling whatever little assets they have."
  },
  "https://timesofindia.indiatimes.com/technology/tech-news/microsoft-co-founder-bill-gates-son-in-law-to-compete-in-paris-olympics-2024-heres-the-country-he-will-represent-and-more/articleshow/112133051.cms": {
    "name": "Microsoft co-founder Bill Gatesâ\u0080\u0099 son-in-law to compete in Paris Olympics 2024: Hereâ\u0080\u0099s the country he will represent and more",
    "articleBody": "Nayel Nassar, the husband of tech billionaire Bill Gates' eldest daughter Jennifer, is set to represent Egypt in the equestrian jumping event at the Paris Olympics. The Egyptian-American equestrian has previously competed in the 2020 Tokyo Olympics, achieving 16th and 24th positions in the team and individual events, respectively. Nassar's participation in the Paris Olympics comes as his wife, Jennifer Gates, prepares to welcome their second child. The couple married in 2021 and welcomed their first child in 2023.Nassar began his equestrian career at a young age, participating in international competitions since his teens. His inclusion in the Egyptian Olympic team highlights the growing influence of equestrian sports in the country.Melinda Gates, Jennifer's mother, has expressed her support for Nassar on social media, wishing him success in the upcoming Olympics. In an Instagram post, the philanthropist shared Nassar's photo and wrote: â\u0080\u009cSo excited to watch you compete at the Olympics, @nayelnassar! Iâ\u0080\u0099m rooting for you.â\u0080\u009d The Gates family has been in the public eye following the high-profile divorce of Bill and Melinda Gates in 2022. Despite the separation, the former couple continues to co-parent their three children.Nayel Nassarâ\u0080\u0099s Olympics participation faces criticismAccording to a report by EssentiallySports, Nassar's participation has been overshadowed by controversy surrounding the size of his support team. A ten-person delegation accompanying the athlete to Paris has sparked public outrage, with many questioning the necessity of such a large entourage at public expense. While the Egyptian Equestrian Federation has denied any financial support for Nassar or his team, claiming they covered all expenses, the controversy continues to simmer.Despite the off-field drama, Nassar remains focused on his performance in the equestrian competition. A seasoned athlete with previous Olympic experience, he aims to clinch his first Olympic medal in Paris.  Nassar's journey to the Olympics has been marked by significant achievements, including a bronze medal at the Winter Equestrian Festival and a victory at the CSIO4*-W Nations Cup of Rabat.",
    "articleSummary": "Nayel Nassar is set to represent Egypt in the equestrian jumping event at the Paris Olympics. The Egyptian-American has previously competed in the 2020 Tokyo Olympics, achieving 16th and 24th positions in the team and individual events, respectively. Nassar's participation has been overshadowed by controversy surrounding the size of his support team."
  },
  "https://timesofindia.indiatimes.com/city/mumbai/at-36c-cold-desert-leh-too-hot-for-flights-12-cancelled-in-3-days/articleshow/112119451.cms": {
    "name": "At 36Â°C, â\u0080\u0098cold desertâ\u0080\u0099 Leh too hot for flights; 12 cancelled in 3 days",
    "articleBody": "Mumbai/New Delhi: The cold desert is getting too hot for flights to operate, in perhaps the most stark sign of global warming. Since Saturday, flight operations at Leh, Indiaâ\u0080\u0099s highest commercial airport, have been affected as IndiGo and SpiceJet have been forced to cancel a dozen flights scheduled around noon as day-time temperatures soared to 36 degrees Celsius, rendering the high-altitude air too thin for safe aircraft operations.â\u0080\u009cThis is probably the first time that airline flights have been cancelled because of high temperatures. Last year, the temperature was not so high as to affect flights,â\u0080\u009d said an official from Leh airport, requesting anonymity. He added that most of the flights cancelled since Saturday were Delhi-bound. 112119449 Leh sees some 15-16 aircraft arrivals and as many departures daily. Saturday saw two flight cancellations, followed by four on Sunday with as many as six cancelled on Monday.We also published the following articles recently Air Canada flight cancelled due to flight attendant's 'inappropriate behaviour'A Montreal-bound Air Canada flight from Morocco was canceled after a flight attendant was recorded yelling at a passenger. Passengers were delayed until Sunday and offered compensation. The airline issued an apology and is reviewing the incident. The flight was initially set to depart on Friday but had to return to the gate due to the conflict.112115126 Beirut airport cancels flights amid fears of Israeli attack; airlines cite 'insurance risks'Several flights at Beirut airport were cancelled or delayed due to increasing tensions between Israel and Hezbollah after a deadly rocket strike in Golan Heights. Insurance risks prompted airlines, including Lufthansa and Turkish Airlines, to suspend flights. The escalating conflict has affected travel and shipping in the region.112094937 83-year-old missing since CrowdStrike outage caused flight cancellation, police launch searchAn 83-year-old man, Patrick A Bailey, has been missing for a week after his flight was canceled at Orlando International Airport due to a CrowdStrike outage. Bailey left his cellphone at a hotel, making contact difficult. His son and the Orlando Police Department urge anyone with information on his whereabouts to come forward.112090001",
    "articleSummary": "Since Saturday, flight operations at Leh, Indiaâ\u0080\u0099s highest commercial airport, have been affected as day-time temperatures soared to 36 degrees Celsius. IndiGo and SpiceJet have been forced to cancel a dozen flights scheduled around noon as the high-altitude air too thin for safe aircraft operations."
  },
  "https://timesofindia.indiatimes.com/sports/paris-olympics-2024/indiaparis/india-is-incredibly-delighted-pm-modi-congratulates-manu-bhaker-and-sarabjot-singh-on-paris-olympic-bronze/articleshow/112132679.cms": {
    "name": "'India is incredibly delighted': PM Modi congratulates Manu Bhaker and Sarabjot Singh on Paris Olympic bronze",
    "articleBody": "NEW DELHI: Prime Minister Narendra Modi on Tuesday congratulated Indian shooters Manu Bhaker and Sarabjot Singh for winning the bronze medal in the 10m mixed team event at the Paris Olympics. PM Modi expressed his pride and delight in the duo's success, highlighting their skills and dedication.Live Updates: Paris Olympics Day 4In a message on X, PM Modi stated, \"Our shooters continue to make us proud! Congratulations to Manu Bhaker and Sarabjot Singh for winning the Bronze medal in the 10m Air Pistol Mixed Team event at the Olympics. Both of them have shown great skills and teamwork. India is incredibly delighted.\"He further praised Bhaker for her consistent accomplishments. \"For Manu, this is her second consecutive Olympic medal, showcasing her consistent excellence and dedication,\" Modi added.&mdash; narendramodi (@narendramodi) The Indian pair demonstrated exceptional composure and skill, defeating the South Korean team 16-10 to secure the bronze medal. This victory not only earned India its second medal at the ongoing Summer Games but also marked a historic milestone for Bhaker. She became the first Indian post-Independence to win two medals in a single edition of the Olympics. 112131506Earlier, Bhaker had clinched a bronze medal in the women's 10m air pistol event at the same venue, reinforcing her status as one of India's premier shooters. The synergy between Bhaker and Singh was evident throughout the competition, with Bhaker's composed performance complemented by Singh's supportive role.The Indian shooting contingent has impressed on the global stage, with Bhaker and Singh's victory serving as a testament to their hard work and dedication.",
    "articleSummary": "PM Narendra Modi congratulated Indian shooters Manu Bhaker and Sarabjot Singh. PM Modi expressed his pride and delight in the duo's success, highlighting their skills and dedication. The Indian pair defeated the South Korean team 16-10 to secure the bronze medal."
  },
  "https://timesofindia.indiatimes.com/technology/tech-news/coindcx-co-founder-on-bitcoin-exchange-wazirxs-55/45-plan-hate-to-be-saying-this-/articleshow/112126514.cms": {
    "name": "CoinDCX co-founder slams rival cryptocurrency exchange WazirX's '55/45 plan': Hate to be saying this ...",
    "articleBody": "CoinDCX, one of the biggest rivals of crypto currency platform, WazirX seems not in sync with the '55/45 approach' that the platform has announced to deal with the hacking attack that saw almost half of its reserves getting stolen. On July 19, WazirX experienced a significant security breach, resulting in the loss of over $230 million worth of cryptocurrency assets. In response, WazirX announced on Saturday a controversial solution: distributing the loss among all customers. In a blog post last week, WazirX said that it is navigating the situation with transparency and fairness. \"This approach aims to distribute the financial impact across all users equitably. Unlike traditional recovery methods that can take years, this strategy offers a faster, more flexible solution by allowing immediate access to a significant portion of assets while maintaining the possibility of further recovery for those who choose to wait\" WazirX stated in the post. CoinDCX co-founder slams WazirX's approachSumit Gupta, cofounder of CoinDCX, expressed his concerns on X, formerly Twitter, urging WazirX to rethink its approach to managing the situation. \"Hate to be saying this, but the way @WazirXIndia is handling this entire situation isn't community first and this IMO won't go down well for them. This sadly is also hurting the other ecosystem participants. The first contribution to losses should ALWAYS come from the Company (i.e. WazirX in this case) and the treasury and assets the company holds. I have not seen any such commitment around this from the company side, instead making customers directly absorb the 45% losses is utter nonsense. The poll options are also framed in a manner to protect the business first and not the customers. Hopefully they will reconsider their approach and do what's right by the customers,\" wrote Gupta. He warned further that \"the incident could also negatively impact participation in the broader crypto ecosystem.\"WazirX's controversial solution to security hackWazirX's socialized loss strategy has not gone well with users on the platform. The cryptocurrency exchange is facing a huge backlash from social media users on its approach to deal with the hacking. Several users wrote that the company failed with the security and now wants the customer to pay the price.",
    "articleSummary": "WazirX experienced a security breach on July 19, resulting in the loss of over $230 million worth of cryptocurrency assets. The platform announced on Saturday a controversial solution: distributing the loss among all customers. CoinDCX, one of the biggest rivals of crypto currency platform, is not in sync with the '55/45 approach'"
  },
  "https://timesofindia.indiatimes.com/india/nightmares-every-week-is-this-governance-oppn-targets-govt-over-series-of-rail-accident/articleshow/112128103.cms": {
    "name": "'Nightmares every week, is this governance?' Oppn targets govt over series of rail accidents",
    "articleBody": "NEW DELHI: The opposition parties, including Congress, Samajwadi Party, and Trinamool Congress, criticized the BJP-led central government on Tuesday for the recent spate of railway accidents, accusing the railway ministry of lacking accountability.In the early hours of Tuesday, at least 18 coaches of the Howrah-Mumbai Mail derailed near Barabamboo in Jharkhand's Seraikela-Kharsawan district, resulting in the death of two persons and injuries to 20 others. The accident occurred at 3.45am, approximately 80 km from Jamshedpur, under the jurisdiction of the South Eastern Railway's Chakradharpur Division.PR machine of the 'Fail Minister' continues: CongressThe Congress party slammed railway minister Ashwini Vaishnaw and reffered to him as the \"fail minister\" Congress general secretary in-charge communications Jairam Ramesh said in a post on X, \"Yet another railway accident. But the PR machine of the Fail Minister continues.\"\"In June and July 2024 alone, the Fail Minister has overseen three accidents that have cumulatively cost 17 Indians their lives and left 100s injured,\" he said, hitting out at Vaishnaw.Congress leader Pawan Khera highlighted the frequency of train accidents in Modi's New India, referring to them as \"a weekly reality.\"\"July 18: Train accident in Gonda, UP: Chandigarh-Dibrugarh Express: 4 killed, 31 injured. July 19: Goods train derailed in Valsad, Gujarat. July 20: 12 wagons of a freight train derailed in Amroha, UP. July 21: 3 wagons of a goods train derailed in Alwar, Rajasthan. July 21: Goods train derailed in Ranaghat, West Bengal. July 26: Goods train derailed at Bhubaneswar Railway Station, Orissa. July 29: Bihar Sampark Kranti Express detached from other coaches in Samastipur, Bihar. July 30: Several coaches of the Howrah-CSMT Express train derailed in Chakradharpur, Jharkhand: 2 killed, 20 injured,\" he said.&mdash; INCIndia (@INCIndia) Nightmares every week, says Bengal CM Mamata BanerjeeWest Bengal chief minister Mamata Banerjee expressed her concern over the \"disastrous\" Howrah-Mumbai Mail train accident and questioned the central government's governance. \"I seriously ask: is this governance? This series of nightmares almost every week, this unending procession of deaths and injuries on railway tracks: for how long shall we tolerate this? Will there be no end to the callousness of Government of India?!\" Banerjee said.\"My heart goes out to the bereaved families, condolences to the next of kin,\" she said.People thank God when a day passes without any train accident: RJD MP Manoj JhaRJD MP Manoj Jha pointed out the irony of people thanking God when a day passes without any train accidents. He questioned the progress of the 'Kavach' safety system, which was prominently mentioned in the previous Budget but was not even discussed this time. \"People thank God when a day passes without any train accident. Tall claims were made regarding 'Kavach' in the last Budget. This time, it was not even mentioned. I would like to ask how much distance has been covered under 'Kavach' cover or was that just for media management? I think Government is not bothered even after such accidents,\" Jha said.'Seems that government wants to make a record in every field': Akhilesh YadavSamajwadi Party MP Akhilesh Yadav questioned the effectiveness of the government's safety and security claims and the allocation of a substantial Budget in light of the recurring accidents.\"It seems that the government wants to make a record in every field. A record is also going to be made of the number of paper leaks. Despite the govt's claims of safety and security and a big budget, why are accidents happening?...Some time ago, India participated in COP29 & G20 was also held...Uttarakhand has also seen landslides. The government should tell what it is doing to tackle such incidents,\" Akhilesh said. Minister for Railways has some 'Kavach' for sure, says Aaditya ThackerayShiv Sena UBT leader Aaditya Thackeray questioned the lack of action taken against the railway minister, despite the recurring incidents.\"I donâ\u0080\u0099t know about the trains, but the minister for Railways has some â\u0080\u009cKavachâ\u0080\u009d for sure, because of which he hasnâ\u0080\u0099t been sacked even after so many rail accidents in his tenure. Every week we see some accidents, and thereâ\u0080\u0099s no action taken. Instead, the Minister has been made the â\u0080\u0098political in- chargeâ\u0080\u0099 of bjp Maharashtra for the elections. Shouldnâ\u0080\u0099t he be focusing on the Ministry?\" Shiv Aaditya Thackeray said in a post on X.The Howrah-Mumbai Mail derailment is the latest in a series of rail accidents that have occurred in the past year, with the most recent major incident being the Kanchenjunga Express derailment in Darjeeling, West Bengal, in June 2024, which claimed the lives of more than 15 people and left dozens injured.",
    "articleSummary": "The Howrah-Mumbai Mail derailment is the latest in a series of rail accidents that have occurred in the past year. Shiv Sena UBT leader Aaditya Thackeray questioned the lack of action taken against the railway minister. 18 coaches of the Howrah-Mumbai Mail derailed near Barabamboo in Jharkhand's Seraikela-Kharsawan district, resulting in the death of two persons. The accident occurred at 3.45am, approximately 80 km from Jamshedpur, under the jurisdiction of the South Eastern Railway's Chakradharpur Division."
  },
  "https://timesofindia.indiatimes.com/business/india-business/with-all-due-respect-dont-be-a-bih-startup-founder-shares-horrors-of-hiring/articleshow/112131265.cms": {
    "name": "'With all due respect, don't be a bi**h': Startup founder shares horrors of hiring",
    "articleBody": "NEW DELHI: Founder of Grump start-up Senain Sawant shared the horrors of hiring she recently faced after being called a \"bi**h\" by an applicant during an interview. Posting the screenshots of the chat, Sawant said, \"The younger generation is in clear need of strong guidance, and as a young entrepreneur myself, I am appalled by the audacity of this candidate to think it is okay to call the company founder, or anyone in a hiring position for that matter, a Bi***\"Sawant had scheduled a video interview with the applicant which, due to some technical reasons at the latter's fault, couldn't work out. \"They joined the call with the camera off, said they don't own a computer and something about ios update not allowing video calls. I responded with, 'how do you usually work?', to which they replied 'My previous company gave us a laptop, but if one is needed, I can arrange,\" she wrote in a Linkedin post.Observing that their \"tone was off from the start\", Sawant said, \"I asked them to join at a time when their video can be turned on, since this an interview and I need to see who I'm speaking with. They said \"Fine\" and cut the call. Their tone was off from the start, they weren't audible to begin with and it seemed like they were out in public from the amount of noise in the background.\"",
    "articleSummary": "Sawant had scheduled a video interview with the applicant which, due to some technical reasons at the latter's fault, couldn't work out. Posting the screenshots of the chat, Sawant said, \"The younger generation is in clear need of strong guidance\""
  },
  "https://timesofindia.indiatimes.com/sports/paris-olympics-2024/indiaparis/paris-olympics-another-olympic-medal-for-manu-bhaker-as-she-wins-10m-air-pistol-mixed-team-event-bronze-medal-match-with-sarabjot-singh/articleshow/112130992.cms": {
    "name": "Paris Olympics: Another Olympic medal for Manu Bhaker as she wins 10m Air Pistol Mixed Team event bronze-medal match with Sarabjot Singh",
    "articleBody": "NEW DELHI: With her confidence sky high after breaking shooting's Olympic medal drought following a long three-year wait, Manu Bhaker didn't let her fans down as she, along with Sarabjot Singh, won the bronze-medal match in the 10m air pistol team event at the shooting range at Chateauroux on Tuesday.Manu and Sarabjot took on Korea in the battle for third place on Tuesday and the Indian duo won the match by 16 points to 10.At the shooting range in Chateauroux, the Indian team defeated the Korean team of Lee Wonoho and Oh Yeh Jin 16â\u0080\u009310 to win the nation's second medal.The 22-year-old Manu is the first Indian to win two medals at the same Olympics (post Independence).Manu had earlier bagged the bronze medal in the women's 10m air pistol event at the same venue.In the pre-Independence era, British-Indian athlete Norman Pritchard had won two silver medals in 200m sprint and 200m hurdles at the 1900 Olympics.\"I'm feeling really proud and there is a lot of gratitude, thanks for all the blessings\" said Bhaker after the match, which the two young Indians played with remarkable poise to make it a one-sided contest.\"Actually we can't control (what the rivals will do), we can do what is in our hand, me and my partner thought let's just try our best and we will keep fighting till the end,\" added the shooter from Jhajjar in Haryana. &mdash; narendramodi (@narendramodi) Three days ago, Sarabjot, who had gone through a challenging time attempting to cope with the disappointment of losing the solo competition, said he felt a lot of pressure to do well.\"I'm feeling good, the game was very tough and there was a lot of pressure, I am very happy,\" said the 22-year-old Sarabjot, who comes from a farming family.Sarabjot's first attempt for the Indians yielded a dismal 8.6, and Bhaker's shot of 10.2 resulted in an overall score of 18.8. With a total of 20.5, the Koreans won the first round and took a 2-0 lead.The team with the most pointsâ\u0080\u009416â\u0080\u0094wins the medal in mixed team competitions.At a deficit of 0â\u0080\u00932, Bhaker's reliability was evident, and Sarabjot benefited from it as they won the following four games to increase their lead to 8â\u0080\u00932.Bhaker was so confident that during the entire 13-round competition, she only had three shots below ten.The Koreans faced an uphill battle as they gave in to pressure and lost 16â\u0080\u009310, unable to equal their opponents.On Monday, Manu and Sarabjot tallied 580 points as India finished third, just a point behind Serbia, who entered the gold medal match against Turkiye. Korea bagged the last spot in the medal round with 579 points, pushing the Chinese second team to fifth place.The second Indian team in the fray - Rhythm Sangwan and Arjun Singh Cheema - had finished in 10th spot with a total of 576 points on Monday.&mdash; WeAreTeamIndia (@WeAreTeamIndia) ",
    "articleSummary": "Manu Bhaker is the first Indian to win two medals at the same Olympics (post Independence) Bhaker, along with Sarabjot Singh, won the bronze-medal match in the 10m air pistol team event. The Indian team defeated the Korean team of Lee Wonoho and Oh Yeh Jin 16â\u0080\u009310."
  },
  "https://timesofindia.indiatimes.com/city/lucknow/to-curb-love-jihad-up-proposes-life-imprisonment-for-accused/articleshow/112129542.cms": {
    "name": "To 'curb love jihad', UP proposes life imprisonment for accused",
    "articleBody": "LUCKNOW: The Uttar Pradesh Assembly is set to consider and potentially pass a bill on Tuesday that aims to amend the Unlawful Conversion of Religion Act, increasing the maximum punishment to life imprisonment and a fine of Rs 5 lakh for violators. The amendment targets anyone who threatens, attacks, marries, promises to marry, conspires, or traffics a woman, minor, or any person with the intention of conversion, categorizing these actions as severe crimes.The proposed amendment, named the Uttar Pradesh Prohibition of Unlawful Conversion of Religion Bill, 2024, stipulates penalties of 20 years to life imprisonment for such offenses. Previously, the maximum punishment was 10 years and a fine of Rs 50,000.Parliamentary Affairs Minister Suresh Khanna introduced the bill in the House on Monday. The amended provisions allow any person to register an FIR in conversion cases, expanding the scope from the previous requirement where the victim, their parents, or siblings needed to lodge the complaint. Now, anyone can inform the police about such cases in writing.â\u0080\u009cThese cases will not be heard by any court below sessions court,â\u0080\u009d states the amended bill. Additionally, it highlights that bail pleas will not be considered without giving an opportunity to the public prosecutor, and all offenses under this act will be non-bailable.Chief Minister Yogi Adityanath initiated this bill as part of efforts to curb what is termed \"love jihad,\" referring to alleged forcible conversion under the guise of marriage. An ordinance was first issued in November 2020, and after the bill was passed by both houses of the Uttar Pradesh Legislature, the Uttar Pradesh Prohibition of Unlawful Conversion of Religion Act, 2021 came into effect.This forthcoming legislative session will be crucial as it deliberates on these significant amendments aimed at deterring unlawful religious conversions, potentially leading to stricter legal repercussions for offenders.",
    "articleSummary": "The amendment targets anyone who threatens, attacks, marries, promises to marry, conspires, or traffics a woman, minor, or any person with the intention of conversion. Chief Minister Yogi Adityanath initiated this bill as part of efforts to curb what is termed \"love jihad\""
  },
  "https://timesofindia.indiatimes.com/city/kolkata/a319-kolkata-faridabad-flight-stranded-near-dakshineswar-creates-traffic-chaos/articleshow/112121346.cms": {
    "name": "A319 Faridabad 'flight' gets stranded on busy Kolkata stretch",
    "articleBody": "KOLKATA: The sight of a 110-ft aircraft on a tractor trailer stuck on a busy road near Dakshineswar left motorists and locals amused. Many stopped to take photographs and selfies with the scrapped plane as traffic was hit on both flanks of the road on Monday.The scrapped Airbus A319 that was being transported from Kolkata airport to Faridabad in Haryana on a tractor trailer was the last of the consignment of five planes which had been retired. It had been purchased by Delhi-based firm Moni Ji Enterprises and was being ferried to north India. 112124248 The company buys scrap planes and turns them into restaurants, film shooting sets, installations at city landmarks, amusement parks and innovative office cabins.In the early hours of Monday, the tractor trailer with the plane fuselage on its deck was stopped at the entry point to the Vivekananda Setu next to Dakshineswar temple by traffic cops after the driver missed the diversion to take Nivedita Setu. While it was reversing, the trailer suffered a snag and got stranded. Following daylong deliberation with cops and attempts to repair the trailer, it was finally up for journey again by late on Monday evening.TOI had earlier written how another scrapped aircraft got stranded during the transportation to Amritsar â\u0080\u0094 2,000 kilometres away â\u0080\u0094 in March. It got stuck on the road that PM Narendra Modi was scheduled to take at that time. Two other aircraft had made it to Delhi without a problem. The agency uses trailer trucks with lower ground clearance to avoid the unusual cargo getting stuck under bridges and height barriers. Earlier this month, the fourth aircraft, too, was transported out of the airport.â\u0080\u009cThis particular plane is set to be turned into a restaurant. After the initial fiasco with long trailers, we had brought in new trailers this time to ensure such instances donâ\u0080\u0099t happen again. We also had the necessary permissions from NHAI but then there was some misunderstanding and the trailer got stuck. However, the situation has been sorted and the trailer is on the move,â\u0080\u009d said Ramkesh Sharma of Shree Shyam Lifters from Vadodara, who had been facilitating the logistics.Of the nine Airbus A319 aircraft stationed in Kolkata, five have been retired.â\u0080\u009cAll five scrapped Air India planes have left the airport premises. There are three more retired aircraft â\u0080\u0094 two belonging to Alliance Air and another 9-seater plane belonging to Dylan Aviation School â\u0080\u0094 which are still parked on airport premises. We have asked the airline authorities to remove them from the airport at the earliest,â\u0080\u009d said Pravat Ranjan Beuria, the Kolkata airport director.The aircraft on the stationary trailer became a worry for Barrackpore cops as the unusual cargo turned into a selfie zone for locals and motorists.TOI was at the spot near Daksineshwar college where the trailer and the aircraft were kept on Monday and found a large number of curious onlookers at the spot. â\u0080\u009cItâ\u0080\u0099s not everyday that you get to see an aircraft parked on the roadside. How could we miss such a moment?â\u0080\u009d said Priti Chakraborty, who was spotted taking photos with the aircraft on her way to office at Sector V.Suman Das on a motorbike and Bibha Jha on board a bus were also found taking photos of the parked aircraft.â\u0080\u009cI have never boarded an aircraft and this is the first time I am seeing one from such a close distance,â\u0080\u009d said Jha, who works at a private firm near Lalbazar and had got off the bus in excitement.",
    "articleSummary": "Suman Das on a motorbike and Bibha Jha on board a bus were also found taking photos of the parked aircraft. “I have never boarded an aircraft and this is the first time I am seeing one from such a close distance,â\u0080\u009d said Jha. Airbus A319 was being transported from Kolkata airport to Faridabad in Haryana. It was the last of the consignment of five planes which had been retired. It had been purchased by Delhi-based firm Moni Ji Enterprises and was being ferried to north India."
  },
  "https://timesofindia.indiatimes.com/city/delhi/suv-driver-denies-intention-of-causing-deaths-in-court/articleshow/112119544.cms": {
    "name": "Delhi IAS coaching centre deaths: SUV driver asks 'why I am being blamed? I was driving at 15kmph, other cars passed before and after'",
    "articleBody": "NEW DELHI: Manoj Kathuria, the driver of a sports utility vehicle, told a Delhi court on Monday that he had no knowledge of the students' presence or the intention to cause their deaths. Kathuria is believed to have sped past the streets in Old Rajender Nagar on Saturday, causing a wave of accumulated rainwater to push down the gates of a three-storey building and flooding the basement, which resulted in the death of three coaching centre students.The court of Vinod Kumar, judicial magistrate first class, sent five of the individuals arrested in the case to 14 days in judicial custody till August 12. The court will hear their bail pleas on Tuesday.â\u0080\u009cThe 30-feet-wide road was open. There was 2.5 feet of accumulated water and my speed was just 15kmph. I was driving in the centre of the road,â\u0080\u009d Kathuria told the court through his counsel. â\u0080\u009cCommon people have been arrested to please the media and show the students that something was being done. But no govt officers have been arrested. Intent and knowledge are prerequisites for the offence. How would I know that students were present in the basement?â\u0080\u009dKathuria also said through his counsel that while driving his SUV, there was no way he would have anticipated that there was a library in the basement with students present and that water would enter the basement. â\u0080\u009cOther cars went before me and many others came after me. Why did the water not reach other houses? The fault lies with the institutes and departments. Why were officials of Delhi Jal Board not arrested?â\u0080\u009d he asked.The counsel requested bail for Kathuria, following which the court asked him to file the written submissions on the matter.Kathuria was among the five who had been arrested. The counsel for the four co-owners of the coaching centre's basement â\u0080\u0094 Tejinder Singh, Parvinder Singh, Harvinder Singh and Sarabjeet Singh â\u0080\u0094 told the court that leasing out a building did not fix any liability for an alleged offence, including causing death by negligence and culpable homicide not amounting to murder, on them.The counsel argued that the offences under Bharatiya Nyaya Sanhitaâ\u0080\u0099s sections 102 (culpable homicide by causing the death of a person other than the person whose death was intended), 105 (culpable homicide not amounting to murder) and 106 (causing death by negligence) werenâ\u0080\u0099t applicable to his clients. He contended that these sections were invoked to bypass the 2014 Arnesh Kumar judgment guidelines of the Supreme Court on arrest. â\u0080\u009cThe safety of the building was the sole responsibility of the lessee,â\u0080\u009d he added.",
    "articleSummary": "Manoj Kathuria told a Delhi court on Monday that he had no knowledge of the students' presence or the intention to cause their deaths. Kathuria is believed to have sped past the streets in Old Rajender Nagar on Saturday, causing a wave of accumulated rainwater to push down the gates of a three-storey building. The court of Vinod Kumar sent five of the individuals arrested in the case to 14 days in judicial custody till August 12."
  },
  "https://timesofindia.indiatimes.com/india/babus-skipping-i-day-event-may-face-action/articleshow/112117522.cms": {
    "name": "Babus skipping Independence-Day event may face action",
    "articleBody": "NEW DELHI: Cabinet secretary Rajiv Gauba has written to all secretaries to ensure all invited officials of respective ministries attend the Independence Day celebration at Red Fort \"without fail\". The letter says that \"serious view\" will be taken for being absent. Referring to officials skipping the celebration in the past, Gauba said that though officers invited were expected to be present, \"it has been observed that some do not turn up. This, to say the least, is inappropriate. There is, clearly, a need to remind officers that it is their duty to attend the Independence Day ceremony.\" He directed secretaries to suitably advise all officers. \"You may also like to inform them that a serious view would be taken of their absence on this occasion,\" Gauba added. Officials admitted that many who get invitations don't turn up for th event. \"This time an advisory has been issued well in advance to sensitise everyone to follow the instruction. Officials should take pride in attending the national event,\" said an official.",
    "articleSummary": "Cabinet secretary Rajiv Gauba has written to all secretaries to ensure all invited officials of respective ministries attend the Independence Day celebration at Red Fort. Officials admitted that many who get invitations don't turn up for th event."
  },
  "https://timesofindia.indiatimes.com/business/india-business/budget-2024-prime-minister-narendra-modi-address-at-cii-post-budget-conference-top-takeaways-highlights/articleshow/112129118.cms": {
    "name": "Budget 2024 three times UPA's last Budget in 2014: PM Narendra Modi at CII post-Budget conference",
    "articleBody": "Budget 2024: Prime Minister Narendra Modi on Tuesday addressed a CII post-Budget 2024 conference, stating that in 10 years, his government has tripled Indiaâ\u0080\u0099s Budget. The last Budget presented by the Manmohan Singh government in 2014 was of Rs 16 lakh crore. Ten years later, the Union Budget 2024 presented by us a few days ago is Rs 48 lakh crore, which is three times, Modi said.Modi also said that the capital expenditure allocation under his governments has grown manifold. \"Capital expenditure is called the biggest productive medium of resource investment,\" he said at the â\u0080\u0098Journey Towards Viksit Bharat: A Post Union Budget 2024-25' conference. In 2004, the capex allocation of UPAâ\u0080\u0099s first Budget was Rs 90,000 crore. This increased to only Rs 2 lakh crore in the last UPA budget in 2014, Modi said. At present the capex allocation is over Rs 11 lakh crore, Modi added. Modi pointed out that the capex allocation of railways and highways has become 8 times under his government.PM Modi said that India, which is currently the worldâ\u0080\u0099s fifth largest economy, will soon become the third largest. He also noted the time when India had been ranked among the â\u0080\u0098Fragile Fiveâ\u0080\u0099 economies in the world. Modi said that his governments have progressively helped India move from a state of vulnerability to a place of strength.PM Modi also said that in a world where most economies are struggling with low growth and high inflation, India stands out as an economy which is seeing high economic growth and low inflation. He also said that India's fiscal prudence has become an example for the world to see.Modi spoke of the government's initiatives to transform the manufacturing sector of the economy with steps like 'Make in India', Production Linked Incentive (PLI) schemes, liberalisation of FDI norms, setting up of multi-modal logistics hubs.Finance Minister Nirmala Sitharaman presented the first Union Budget of the newly elected NDA government on July 23, 2024.",
    "articleSummary": "Prime Minister Narendra Modi addressed a CII post-Budget 2024 conference. He said that in 10 years, his government has tripled Indiaâ\u0080\u0099s Budget. The last Budget presented by the Manmohan Singh government was of Rs 16 lakh crore."
  },
  "https://timesofindia.indiatimes.com/india/watch-vande-bharat-passenger-goes-berserk-after-served-non-veg-by-mistake-slaps-waiter/articleshow/112127347.cms": {
    "name": "Watch: Vande Bharat Passenger goes berserk after served non-veg by 'mistake'; slaps waiter",
    "articleBody": "NEW DELHI: A video of an altercation between a passenger and pantry staff has gone viral on social media after the passenger, who was a vegetarian was mistakenly served non-vegetarian food. The event snowballed into chaos after the agitated passenger \"gave two tight slaps\" to the waiter upon finding out it was non-veg that he had consumed. Kunal Verma, a fellow passenger who recorded the entire incident on July 26, said in his post on X that the elderly passenger in the Vande Bharat train consumed the food parcel without taking note of the label in the parcel. &mdash; itsmekunal07 (@itsmekunal07) However, the elderly passenger's action irked co-passengers, who immediately objected to his actions. In the video, the passenger questions, â\u0080\u009cWhere is it mentioned?â\u0080\u009d possibly referring to the lack of a non-vegetarian symbol on the food parcel.A fellow passenger reprimands him, saying, â\u0080\u009cWhy would you slap him? Look at your age.â\u0080\u009d The waiter is seen apologizing, while other passengers demand an apology from the elderly man, with several condemning his action and expressing shock at his treatment of the waiter.In a separate video, the elderly passenger is seen arguing with another co-passenger, who tells him, â\u0080\u009cYou should be ashamed of yourself,â\u0080\u009d criticising him as â\u0080\u009coversmart.â\u0080\u009dThis incident follows another from January, where a video of two passengers arguing over luggage space on a Vande Bharat Express went viral, showing the two men shouting at each other until a railway officer intervened to defuse the situation.",
    "articleSummary": "A video of an altercation between a passenger and pantry staff has gone viral on social media. The passenger, who was a vegetarian was mistakenly served non-vegetarian food. The event snowballed into chaos after the agitated passenger \"gave two tight slaps\" to the waiter."
  },
  "https://timesofindia.indiatimes.com/world/pakistan/pakistan-beggar-found-unconscious-with-over-pkr-5-lakh-saudi-passport-in-pocket/articleshow/112128230.cms": {
    "name": "Pakistan beggar found unconscious with over PKR 5 lakh, Saudi passport in pocket",
    "articleBody": "NEW DELHI: An elderly beggar was found unconscious on Khushab Road in Pakistan Punjab's Sargodha district by the Rescue 1122 team, with over Rs 0.5 million (1,60,544 INR) in his pocket. The man was carrying PKR 534,000 and a passport indicating multiple trips to Saudi Arabia. Upon discharge from the hospital, he retrieved his money and belongings, according to Geo News. Residents in the area informed the rescue team that this man had been begging regularly in the same vicinity.In September last year, concerns had been raised about Pakistani nationals exploiting Umrah visas for begging in Saudi Arabia. According to The News report, the ministry of overseas Pakistanis and Human Resource Development reported this issue to the Senate Committee on Overseas Pakistanis.At a standing committee meeting, the secretary of the ministry of overseas Pakistanis stated that 90% of beggars detained in foreign countries were Pakistanis. \"The Iraqi and Saudi ambassadors have reported that their jails were overcrowded due to these arrests,â\u0080\u009d he told the senate committee. â\u0080\u009cMost of the pickpockets caught inside the Masjid Al Haram in Saudi Arabia were of Pakistani origin, and they exploited the Umrah visas for begging purposes.\"",
    "articleSummary": "An elderly beggar was found unconscious on Khushab Road in Pakistan Punjab's Sargodha district. The man was carrying PKR 534,000 and a passport indicating multiple trips to Saudi Arabia. Residents in the area informed the rescue team that this man had been begging regularly in the same vicinity."
  },
  "https://timesofindia.indiatimes.com/business/india-business/august-2024-bank-holidays-banks-closed-up-to-13-days-check-full-list-of-state-wise-bank-holidays/articleshow/112129996.cms": {
    "name": "August 2024 Bank Holidays: Banks closed up to 13 days - check full list of state-wise bank holidays",
    "articleBody": "August 2024 Bank Holidays: In August, banks across India, both public and private, will be closed for up to 13 days, including Sundays, national and regional holidays, and the second and fourth Saturdays of the month.Various festivals will be celebrated in different states during August, leading to bank closures. These include Ker Puja, Tendong Lho Rum Faat, Patriot's Day, Independence Day/Parsi New Year (Shahenshahi), Raksha Bandhan, Janmashtami. The specific dates and states affected by these closures vary.August 2024: Full List of Bank HolidaysAugust 3 (Saturday) - Ker Puja: Banks closed in Agartala.August 8 (Thursday) - Tendong Lho Rum Faat: Banks closed in Sikkim.August 13 (Tuesday) - Patriotâ\u0080\u0099s Day: Banks closed in Manipur.August 15 (Thursday) - Independence Day/Parsi New Year (Shahenshahi): All banks in India closed.August 19 (Monday) - Raksha Bandhan/Jhulana Purnima/Birthday of Bir Bikram Kishore Manikya Bahadur: Banks closed in Tripura, Gujarat, Odisha, Uttarakhand, Rajasthan, Uttar Pradesh, and Himachal Pradesh.August 20 (Tuesday) - Sree Narayana Guru Jayanthi: Banks closed in Kerala.August 26 (Monday) - Janmashtami (Shravan Vad-8)/Krishna Jayanthi: Banks closed in Gujarat, Odisha, Chandigarh, Tamil Nadu, Uttarakhand, Sikkim, Andhra Pradesh, Telangana, Rajasthan, Jammu, Uttar Pradesh, West Bengal, Bihar, Chhattisgarh, Jharkhand, Meghalaya, Himachal Pradesh, and Srinagar.Aug-24381315192026Agartalaâ\u0080¢â\u0080¢â\u0080¢Ahmedabadâ\u0080¢â\u0080¢â\u0080¢Aizawlâ\u0080¢Belapurâ\u0080¢Bengaluruâ\u0080¢Bhopalâ\u0080¢Bhubaneswarâ\u0080¢â\u0080¢â\u0080¢Chandigarhâ\u0080¢â\u0080¢Chennaiâ\u0080¢â\u0080¢Dehradunâ\u0080¢â\u0080¢â\u0080¢Gangtokâ\u0080¢â\u0080¢â\u0080¢Guwahatiâ\u0080¢Hyderabad - Andhra Pradeshâ\u0080¢â\u0080¢Hyderabad - Telanganaâ\u0080¢â\u0080¢Imphalâ\u0080¢â\u0080¢Itanagarâ\u0080¢Jaipurâ\u0080¢â\u0080¢â\u0080¢Jammuâ\u0080¢â\u0080¢Kanpurâ\u0080¢â\u0080¢â\u0080¢Kochiâ\u0080¢â\u0080¢Kohimaâ\u0080¢Kolkataâ\u0080¢â\u0080¢Lucknowâ\u0080¢â\u0080¢â\u0080¢Mumbaiâ\u0080¢Nagpurâ\u0080¢New Delhiâ\u0080¢Panajiâ\u0080¢Patnaâ\u0080¢â\u0080¢Raipurâ\u0080¢â\u0080¢Ranchiâ\u0080¢â\u0080¢Shillongâ\u0080¢â\u0080¢Shimlaâ\u0080¢â\u0080¢â\u0080¢Srinagarâ\u0080¢â\u0080¢Thiruvananthapuramâ\u0080¢â\u0080¢This year, August 15, which is Independence Day, falls on a Thursday, so there will not be an extended weekend during that week.However, in certain states, there will be a long weekend due to the closure of banks on Monday, August 26, for Janmashtami (Shravan Vad-8)/Krishna Jayanthi, which follows the fourth Saturday and Sunday of the month. According to an ET report, the states affected by this long weekend include Gujarat, Orissa, Chandigarh, Tamil Nadu, Uttarakhand, Sikkim, Andhra Pradesh, Telangana, Rajasthan, Jammu, Uttar Pradesh, Bengal, Bihar, Chhattisgarh, Jharkhand, Meghalaya, Himachal Pradesh, and Srinagar.",
    "articleSummary": "In August 2024, banks across India will be closed for up to 13 days. This includes Sundays, national and regional holidays, and the second and fourth Saturdays of the month. These include Ker Puja, Tendong Lho Rum Faat, Patriot's Day, Independence Day/Parsi New Year, Raksha Bandhan, Janmashtami."
  },
  "https://timesofindia.indiatimes.com/india/in-pm-modis-amritkaal-empty-pockets-of-common-citizens-also-being-extracted-rahul-gandhi/articleshow/112130653.cms": {
    "name": "In PM Modi's 'Amritkaal' empty pockets of common citizens also being extracted: Rahul Gandhi",
    "articleBody": "Congress leader Rahul Gandhi on Tuesday targeted the Centre over substantial penalties collected by public sector banks from customers who failed to maintain the required average monthly balance.In a post on X, Rahul aserted that this \"penalty system\" is a part of Prime Minister Narendra Modi's elaborate scheme, likening it to a \"chakravyuh,\" an inescapable trap, designed to burden the average Indian citizen. \"In the Amritkaal of Narendra Modi, the 'empty pockets' of common Indians are also being extracted. The government that waived off Rs 16 lakh crore of its industrialists has collected Rs 8,500 crore from poor Indians who are unable to maintain even the minimum balance,\" Rahul Gandhi said.&mdash; RahulGandhi (@RahulGandhi) \"The penalty system is the door of Modi's Chakravyuh through which an attempt is being made to break the back of the common Indian. But remember, the people of India are not Abhimanyu, they are Arjun, they know how to answer your every atrocity by breaking the Chakravyuh,\" he added.Rahul's criticism followed a written reply in the Lok Sabha, which revealed that public sector banks collected around Rs 8,500 crore in penalties for not maintaining the average monthly minimum balance over five years starting from FY 2019-20. Pankaj Chaudhary, the minister of state in the finance ministry, also informed the Lok Sabha on Monday that state-run banks have charged depositors Rs 2,331 crore in penalties for the same reason in FY24.Rahul's comments come a day after he accused the NDA government in the Lok Sabha of trapping farmers, youth, soldiers, backward classes, and MSMEs in a vicious \"chakravyuh\" under Modi's regime. He expressed disappointment that the finance minister did not address farmers' demands for a legal guarantee on MSP and the caste census clamor.On Monday, Rahul used the \"chakravyuh\" theme, suggesting that the mythological episode from Kurukshetra was being re-enacted in the 21st century by a \"trap\" controlled by the PM, home minister, RSS chief Mohan Bhagwat, Gautam Adani, Mukesh Ambani, and NSA Ajit Doval.Finance minister Nirmala Sitharaman presented the Union Budget on July 23 in the Parliament, making significant announcements for Bihar and Andhra Pradesh.",
    "articleSummary": "Rahul Gandhi likens penalty system to a \"chakravyuh,\" an inescapable trap, designed to burden the average Indian citizen. Public sector banks collected around Rs 8,500 crore in penalties for not maintaining the average monthly minimum balance."
  },
  "https://timesofindia.indiatimes.com/science/twin-meteor-showers-to-peak-within-24-hours-heres-when-where-to-watch/articleshow/112129994.cms": {
    "name": "Twin meteor showers to peak within 24 hours; here's when & where to watch",
    "articleBody": "Two meteor showers are all set to light up the night sky on July 30 and July 31 and one can watch up to 25 meteors per hour depending on their location, as per the American Meteor Society. The Alpha Capricornids and the Southern Delta Aquariids will peak simultaneously. \"It's just an amazing coincidence,\" said Nicholas Moskovitz, a planetary astronomer at Lowell Observatory in Arizona, according to CNN.Having two meteor showers peak within 24 hours is \"a little bit unusual,\" Moskovitz told Live Science. \"But the idea of multiple showers being visible in a single night? Certainly not too uncommon.\"When and where to watchMeteor showers occur when Earth's orbit intersects a comet's path, causing the rocky debris left behind by the comet to burn up as it enters Earth's atmosphere. During this double meteor shower, Earth will cross the orbits of comet 96P/Machholz, causing the Southern Delta Aquariids to peak from July 29 to July 30, and comet 169P/NEAT, which creates the Alpha Capricornids peaking from July 30 to July 31.Wednesday night is the best time to view both showers, according to Robert Lunsford of the American Meteor Society. As the moon wanes, it loses about 8% illumination each night, which can hinder the visibility of fainter meteors. On Monday, the moon will be about 34% full, and on Wednesday it will be 16% full, according to Nasa's Daily Moon Guide. Best viewing conditionsThe double meteor shower will be best viewed in the Southern Hemisphere, where the radiant, or the apparent point from which the shower originates, will be almost overhead. However, people in the Northern Hemisphere can also see the meteor shower if they have a clear view of the southern horizon. Both meteor showers will continue until mid-August.\"Almost all meteor showers peak in the early morning hours between 2 and 4 am,\" Moskovitz said. \"So if you want to catch either one of these, your best chances of seeing meteors are to get to a dark site and do so after midnight.\"Viewing tipsBoth showers are best viewed with the naked eye. For other skywatching events this year, a new pair of binoculars or a good backyard telescope might be useful.The science behind meteor showersMeteor showers occur at regular intervals due to their predictable orbits around the sun. The intensity of these showers can vary annually, influenced by when comets release debris and the duration the debris has been in space. Predicting meteor showers is crucial for the safety of spacecraft and humans traveling in space, said Moskovitz, who leads the Lowell Observatory Cameras for All-Sky Meteor Surveillance (LO-CAMS), a network of cameras monitoring meteors.Southern Delta Aquariids and Alpha CapricornidsAt its peak, the Southern Delta Aquariids will display around 20 to 25 meteors per hour, compared to \"background\" meteor showers that typically show around five meteors per hour. The Southern Delta Aquariids will appear \"pretty faint,\" Moskovitz said. \"You really need to get to a dark site, away from lights and traffic, stay off your cell phones, let your eyes acclimate to the dark, and you may have a chance of seeing some of those faint objects.\"In contrast, the Alpha Capricornids are less frequent but often produce \"bright fireballs with bigger meteor chunks coming in, burning up, and getting brighter, making for a more spectacular show,\" Moskovitz explained. These bright meteors are composed of marble-sized particles, while the fainter meteors are usually grain-sized.",
    "articleSummary": "The Alpha Capricornids are less frequent but often produce bright fireballs. These bright meteors are composed of marble-sized particles. The fainter meteors usually are usually grain-sized. Two meteor showers are set to light up the night sky on July 30 and July 31. The Alpha Capricornids and the Southern Delta Aquariids will peak simultaneously. One can watch up to 25 meteors per hour depending on their location, as per the American Meteor Society."
  },
  "https://timesofindia.indiatimes.com/india/i-dont-dream-like-mungerilal-brij-bhushan-sharan-singh-says-bjp-will-not-give-him-a-chance-now/articleshow/112126914.cms": {
    "name": "'I don't dream like Mungerilal': Brij Bhushan Sharan Singh says BJP will not give him a chance now",
    "articleBody": "NEW DELHI: Former BJP MP from Kaiserganj and Wrestling Federation of India chief Brij Bhushan Sharan Singh, facing sexual harassment allegations, said on Monday that he did not expect another ticket from his party.During his tour of his former parliamentary constituency in Gonda district, Brij Bhushan made a stop in Paraspur to meet the family members of murdered Samajwadi Party leader Om Prakash Singh. Answering reporters' questions in Paraspur, Brij Bhushan said, \"The BJP will never give me a chance now. I know the party will not give me a chance. I don't dream like Mungerilal. Those who want to, can.\" Mungerilal is the lead character of â\u0080\u0098Mungerilal ke haseen sapne,â\u0080\u0099 a 1989 TV show, who was a daydreamer.Brij Bhushan is accused of sexually harassing several women wrestlers. Following a major controversy and a protracted protest by prominent wrestlers last year, he was removed from his position. Consequently, he was not allowed to contest in the Lok Sabha election. His son Karan Bhushan Singh, however, won the constituency previously held by his father on BJP ticket.The trial against him commenced last week, invoking charges under the Indian Penal Code related to sexual harassment, use of force against a woman, and criminal intimidation. The former MP has pleaded not guilty to these charges, maintaining his innocence.",
    "articleSummary": "Brij Bhushan is accused of sexually harassing several women wrestlers. Following a major controversy and a protracted protest by prominent wrestlers, he was removed from his position. He was not allowed to contest in the Lok Sabha election."
  },
  "https://timesofindia.indiatimes.com/city/pune/more-trouble-on-cards-for-ias-officer-puja-khedkar-as-dept-of-personnel-seeks-response-on-allegations/articleshow/112125485.cms": {
    "name": "More trouble on cards for IAS officer Puja Khedkar as dept of personnel seeks response on allegations",
    "articleBody": "PUNE: The Department of Personnel and Training (DoPT) has issued a show-cause notice to IAS trainee Puja Khedkar asking her to explain by Aug 2 her position on the various allegations against her.\"The show-cause was sent on July 26 by email as well as to her postal address, following inquiries by various agencies. Khedkar has been given seven days to respond to the notice,\" DoPT officials privy to the developments told TOI on Monday.\"The notice, issued as per procedure, seeks her response, which she has to either give in person by coming before the DoPT or send the same in writing,\" an official said.  Puja yet to report to Mussoorie academy: Officials  The official said it was up to Puja Khedkar how she would respond to the show cause. \"We have sent the mail to her official email address as well as have sent the notice to her postal address. If she fails to respond within the deadline, further action will be considered,\" the official said.The central govt has constituted a single-member panel to verify Khedkar's candidature claims and other details based on a report filed by the Maharashtra govt. Khedkar, if found guilty of making wrongful claims, can face termination from service.Based on the Union Public Service Commission's complaint, the Delhi police's crime branch has already registered a case of cheating, fraud and forgery against Khedkar.Last week, the single member committee submitted its report to the DoPT secretary. A DoPT team is examining the findings of this report and will recommend the necessary action.DoPT officials said Khedkar was supposed to report to Lal Bahadur Shastri National Academy of Administration in Mussoorie by July 23 after being relieved of her district training program from Washim in Maharashtra. However, officials from the academy confirmed on Monday that she was yet to report there.Pune's additional commissioner of police (Crime) Shailesh Balkawade told TOI, \"The Delhi police crime branch has not contacted us for any help or seeking information in respect of the cheating and forgery case registered by the UPSC against IAS probationary officer Puja Khedkar.\"",
    "articleSummary": "The show-cause was sent on July 26 by email as well as to her postal address. Khedkar has been given seven days to respond to the notice. Delhi police's crime branch has already registered a case of cheating, fraud and forgery."
  },
  "https://timesofindia.indiatimes.com/sports/paris-olympics-2024/indiaparis/i-need-to-find-a-job-to-earn-money-jaspal-rana-reveals-struggles-after-manu-bhakers-olympic-success/articleshow/112126170.cms": {
    "name": "'I need to find a job to earn money': Manu Bhaker's coach Jaspal Rana reveals his struggles after Tokyo debacle",
    "articleBody": "NEW DELHI: Jaspal Rana, the coach of Olympic medalist Manu Bhaker, recently disclosed his ongoing struggle to secure a permanent job since the Tokyo Olympics. This revelation came after Bhaker's historic achievement of winning a bronze medal in Paris, making her the first female shooter from India to win an Olympic medal.In an emotional interview with RevSportz, Rana shared the hardships he has faced since Bhaker's unexpected exit from the Tokyo Games. He spoke about the criticism he received and the financial difficulties he has endured for the past three years. Live Updates: Paris Olympics Day 4\"All those who abused me, made me a villain after Tokyo, when I was not even present there are now wanting interviews from me. No problem, I did interviews, but are these people going to make up for my losses in life at large?\" Rana questioned, reflecting on the backlash he faced.Despite his happiness over Bhaker's Olympic success, Rana highlighted the lack of financial support from the National Rifle Association of India (NRAI) and other sporting organizations. He has not received any salary for the past three years, leaving him in a challenging financial situation.  112094670\"I am nobody, I just did a job Manu wanted me to help her out with. But are people aware I have had no monthly salary from the National Rifle Association of India or any other agency over the last three years? I am more than happy Manu has shown what she can do, I only tapped into her potential. I need to go back to India and start afresh. I need to find a job to earn money,\" said Rana.Rana expressed his gratitude towards PT Usha and Captain Ajay Narang for their assistance in obtaining accreditation for the Olympics, but he acknowledged the numerous obstacles he encountered even after securing it.During the interview, Rana became emotional, expressing his sense of insignificance and financial hardship. \"Manu is the star, I am just a jobless coach. I am nobody. Manu made me relevant by asking me to help her. I need to find a job soon, these three years have been very tough for me. I never wanted to talk about this. Anyone going to get me a job, I have to ask around when I get back to India,\" he stated.112089259",
    "articleSummary": "Jaspal Rana, the coach of Olympic medalist Manu Bhaker, recently disclosed his ongoing struggle to secure a permanent job since the Tokyo Olympics. This revelation came after Bhaker's historic achievement of winning a bronze medal in Paris. Rana highlighted the lack of financial support from the National Rifle Association of India (NRAI) and other sporting organizations."
  },
  "https://timesofindia.indiatimes.com/business/india-business/itr-filing-fy-2023-24-deadline-extension-will-income-tax-department-extend-the-july-31-2024-deadline-for-filing-tax-returns/articleshow/112127513.cms": {
    "name": "ITR filing FY 2023-24 deadline extension: Will Income Tax Department extend the July 31, 2024 deadline for filing tax returns?",
    "articleBody": "ITR Filing FY 2023-24 deadline extension: The Income Tax Department has advised taxpayers to file their income tax returns for the financial year 2023-24 before the July 31, 2024 deadline.According to an ET report, the Income Tax Department has issued an alert to the public regarding erroneous information published in media about the extension of the ITR filing deadline. \"The department has stated that this is false, and that the deadline for filing ITR for FY2023-24 is July 31, 2024.\" . Will ITR filing deadline for FY 2023-24 be extended?Going by the past record, it is highly unlikely that there will be an extension to the ITR filing deadline this year, as over 5 crore ITRs for AY 2024-25 have already been filed as of July 26th, compared to July 27th last year, the ET report said.. By July 31, 2023, 6.77 crore income tax returns (ITRs) were filed, and it is expected that the current figures will soon surpass the previous ones.Despite numerous technical issues on the e-filing portal, such as problems with Aadhaar-based OTP authentication, slow page loading, and upload errors, it is improbable that the deadline will be extended unless there is a significant technical issue on the website.Also Read | ITR Filing FY 2023-24: What happens if I file income tax return after deadline? Check penalties, consequences for late filingThe All-India Federation of Tax Practitioners (AIFTP) has urged the CBDT to extend the deadline for filing Income Tax returns for the assessment year 2024-25 by one month to August 31, citing the impact of floods and landslides on tax return filings in several states, as well as persistent issues with the Income Tax portal and software, and time-consuming processes for paying self-assessment tax.With just a couple of days left for this year's ITR filing last date, tax filers are still facing issues with the e-filing portal. The CBDT chairman has stated that they are closely engaging with their service providers Infosys, IBM, and Hitachi to address the issues, and has been assured that the website will function properly.110773928",
    "articleSummary": "The Income Tax Department has advised taxpayers to file their income tax returns for the financial year 2023-24 before the July 31, 2024 deadline. The department has issued an alert to the public regarding erroneous information published in media about the extension of the ITR filing deadline."
  },
  "https://timesofindia.indiatimes.com/city/lucknow/mixed-signals-in-up-bjp-morning-bonhomie-and-political-statements/articleshow/112121578.cms": {
    "name": "Morning bonhomie and a day of mixed signals in UP BJP",
    "articleBody": "LUCKNOW: After playing the face of 'defiance' within the UP BJP since the Lok Sabha poll debacle, Deputy chief ministers Keshav Prasad Maurya and Brijesh Pathak appeared on either side of Chief Minister Yogi Adityanath as he chaired the BJP legislative party meeting held ahead of the State Assembly Monsoon Session on Monday.Both Maurya and Pathak have, until now, stayed away from quite a few key govt meetings that were presided over by the CM. Maurya had even skipped the Prayagraj division meeting of BJP MLAs convened by Yogi recently. On Monday, the two deputy CMs were not only seen sitting beside the CM for the first time after the Lok Sabha poll results but also shared the same frame when the CM was speaking to media persons in the morning.By the afternoon, however, it turned out to be a day of mixed political signals as Maurya, while speaking at the party's OBC Morcha event, reiterated his stand that 'it's the political party that wins elections and not any govt'.The CM reached the House about five minutes before the proceedings on the first day of the Monsoon session. Yogi went to the Opposition benches and exchanged greetings with the newly nominated Leader of Opposition in UP Vidhan Sabha, Mata Prasad Pandey, senior SP leaders Shivpal Yadav and others. The CM also met Raja Bhaiyya and his cabinet colleagues Om Prakash Rajbhar.Interestingly, several MLAs from the treasury benches touched Yogiâ\u0080\u0099s feet to seek his blessings. Yogi was also seen interacting with the legislators in an informal manner and listening to them carefully. The picture-perfect moment that caught the attention of photographers and videographers was initially seen by observers as the cascading impact of the Delhi visit.However, barring one meeting of BJP organisation secretary BL Santosh and Yogi which became public, the CM and two deputy CMs' participation in BJP-ruled CMsâ\u0080\u0099 meeting addressed by Prime Minister Narendra Modi and the CMâ\u0080\u0099s participation in NITI Ayog meeting, no reports of any one-on-one or closed-door meetings between any leader connected to UP have come to the fore.The bonhomie later in the day looked like an opportunity to be on the politically right side as Maurya, during the OBC Morcha executive committee meet, again reiterated his earlier stand that the organisation was bigger than the govt. â\u0080\u009cIt is the political party which wins the elections and not any govt. Had that not been the case, the BJP would not have won the 2017 election despite there being no BJP govt in the state then,â\u0080\u009d he said. He, however, also toed the earlier line of the CM and said that overconfidence led to defeat on several seats.Later in the day, he posted on X about his meeting with top police officials as the leader of Vidhan Parishad and stated that the DGP had been instructed to ensure peopleâ\u0080\u0099s problems are heard in police stations and there was a check on corruption.While addressing the BJP working committee meeting members on July 14, the deputy CM said that his pain and that of the party workers were the same. He went on to say that the organisation was bigger than the govt. On the other hand, Yogi in his speech had said that overconfidence led to the partyâ\u0080\u0099s dismal show in the Lok Sabha polls 2024.Since then, there were reports that all was not well in the UP BJP. What gave weight to speculation was Maurya's meeting with BJP chief JP Nadda in Delhi a couple of days after the executive meeting. His meeting was followed by UP BJP chief Bhupendra Chaudharyâ\u0080\u0099s meeting with Nadda, Home Minister Amit Shah and PM Modi on the same day. ",
    "articleSummary": "Since then, there were reports that all was not well in the UP BJP. What gave weight to speculation was Maurya's meeting with BJP chief JP Nadda in Delhi a couple of days after the executive meeting. Keshav Prasad Maurya and Brijesh Pathak appeared on either side of Chief Minister Yogi Adityanath as he chaired the BJP legislative party meeting held ahead of the State Assembly Monsoon Session on Monday. The picture-perfect moment that caught the attention of photographers and videographers was initially seen by observers as the cascading impact of Delhi visit."
  },
  "https://timesofindia.indiatimes.com/sports/cricket/news/watch-local-man-refuses-to-return-match-ball-during-tnpl-game/articleshow/112127330.cms": {
    "name": "Watch: Local man refuses to return match ball during TNPL game",
    "articleBody": "NEW DELHI: Batsmen hitting bowlers for long and big sixes is a common occurrence these days. Sometimes the ball lands in the crowd, sometimes out of the stadium.Invariably, the ball is most of the times thrown back if it lands amongst the spectators. The ball, deemed to be lost, is most of the times replaced when it lands outside the stadium.But have you ever seen a person not returning a match and walking away with it, and that too with utter disdain?Yes, the unthinkable happened during the Tamil Nadu Premier League 2024 clash between Chepauk Super Gillies and Siechem Madurai Panthers at the NPR College Ground in Dindigul last Sunday.A clip shared by Star Sports Tamil shows that a Siechem Madurai Panthers pacer bowled from the round the wicket and a left-handed Chepauk Super Gillies batter read the length, took one step out of the crease and smashed it over the mid-wicket fence.So good was the timing that the ball went all the way out of the ground and the cameras also zoomed in looking for the ball. The cameras show that a local man in a lungi and T-shirt is holding the ball. But to everyone's surprise, he is no mood to throw the ball back into the ground. Not just that, he expresses his anger at the players as if saying that he has had enough of the ball coming to him and he won't return it this time and then nonchalantly walks away with the ball, still shouting angrily towards the ground.Later the man is also shown relaxing on a 'charpoy' as if nothing had happened.&mdash; StarSportsTamil (@StarSportsTamil) As far as the match is concerned, Siechem Madurai Panthers beat Chepauk Super Gillies by 9 runs.",
    "articleSummary": "The incident happened during the Tamil Nadu Premier League 2024 clash between Chepauk Super Gillies and Siechem Madurai Panthers. A clip shared by Star Sports Tamil shows that a local man in a lungi and T-shirt is holding the ball. He expresses his anger at the players as if saying that he has had enough of the ball coming to him and he won't return it this time."
  },
  "https://timesofindia.indiatimes.com/india/10-years-of-the-upa-were-piyush-goyal-hits-back-rahul-gandhi-on-budget-speech/articleshow/112126156.cms": {
    "name": "'10 years of the UPA were ... ': Piyush Goyal hits back Rahul Gandhi on Budget speech",
    "articleBody": "NEW DELHI: Union minister Piyush Goyal on Tuesday responded to leader of opposition Rahul Gandhi a day after the Congress leader went all guns blazing at the Modi government in Lok Sabha during the discussion on Union Budget 2.0.Gandhi on Monday had accused the NDA government of spreading a 'chakravyuh' with everybody trapped in it, including BJP MPs, farmers and workers. The LoP had said that the budget has stabbed the middle class, which enthusiastically banged thalis when asked to do so by PM Modi. Gandhi also slammed the Centre over the internship announcement in the Budget in which the youths will get the opportunity to do internships in the top 500 companies of the country.In response to Gandhi's allegations, Goyal said, \"In every respect the 10 years of the UPA were a failed experiment, reflected a failed government, reflected a failed governance model. And brought the country and people of the country to their knees.\"The Union minister also accused the Congress-led UPA government of not even mentioning bringing in a legal guarantee for MSP in their budget speeches.\"In 2004, the then finance minister, P Chidambaram, is on record to say that he has inherited a strong economy. At that time, the growth rate was over eight per cent, inflation was around four per cent, foreign exchange reserves were robust, compared to the size of the economy at that point of time,\" he said.\"What did the UPA do in the 10 years when they were in government? I have read 10 speeches of the UPA government, never once has there been a mention of bringing in a legal guarantee for MSP. Never once did they speak about trying to uplift the poor by giving them free homes,\" he added. Goyal further accused the UPA government of leaving behind a fragile economy for Modi government. \"They left behind for PM Modi a fragile economy which the world looked down upon. They (Congress) left behind the country high fiscal deficits, high inflations, low growth, very low foreign exchange reserves,\" he said.Gandhi on Monday also attacked Finance Minister Nirmala Sitharaman for not mentioning the paper-leak issue in the Budget speech, which he said is the 'biggest issue affecting youth.' \"In the past 10 years, there have been 70 cases of paper leaks in the country,\" Rahul Gandhi alleged.Showing the poster of the traditional Halwa ceremony, held at the Ministry of Finance before the Budget session, LoP Rahul Gandhi said that 20 officers prepared the Budget of India.Sitharaman had presented the Union Budget on July 23 in the Parliament and made major announcements for Bihar and Andhra Pradesh.",
    "articleSummary": "Gandhi on Monday had accused the NDA government of spreading a 'chakravyuh' with everybody trapped in it. The LoP had said that the budget has stabbed the middle class. Gandhi also slammed the Centre over the internship announcement."
  },
  "https://timesofindia.indiatimes.com/world/us/melania-was-watching-live-trump-reveals-wifes-reaction-to-assassination-attempt/articleshow/112123464.cms": {
    "name": "Melania was â\u0080\u0098watching liveâ\u0080\u0099: Trump reveals wife's reaction to assassination attempt",
    "articleBody": "The former US President Donald Trump, who narrowly survived a shot at his life during a Pennsylvania rally, revealed on Monday that the former first lady Melania Trump was watching it live and was left traumatized so much so that she still struggles to talk about the day he dropped to the ground. And at that moment, Donald Trump said Melania had \"thought the worst had happened.â\u0080\u009dIn an interview to Fox news explaining Melania's immediate reaction, the 45th president said, \"When I went down, she thought the worst had happened,â\u0080\u009d and added â\u0080\u009cbecause I went down and grabbed my hand and my hand was loaded up with blood.â\u0080\u009dâ\u0080\u009cShe canâ\u0080\u0099t really even talk about it, which is okay, because that means she likes me, or she loves me,â\u0080\u009d Trump told the Fox news anchor. The former first lady echoed similar sentiments in her statement post the assassination attempt. \"When I watched that violent bullet strike my husband, Donald, I realized my life, and Barronâ\u0080\u0099s life, were on the brink of devastating change,\" Melania said immediately after the July 13 shooting.  â\u0080\u009cYeah, Iâ\u0080\u0099m going to do ralliesâ\u0080\u009d Despite being so close to being shot dead and the secret service urging him to hold lesser outside rallies, Donald Trump defiantly said that the shooting will not force him to stop holding outside rallies Donald Trump. Trump continued to support the Secret Service agents, who have come under intense scrutiny since July 13 and lost their chief subsequnetly. Trump however said the protective unit shouldâ\u0080\u0099ve coordinated better with local police to stop Crooks while also praising Secret Service detail for leaping on top of him once bullets began flying.â\u0080\u009cThey were very brave. I went down and they were -- they were on top of me, I had a lot of very big, strong people on top of me.\"\"Should've been somebody on the roof, should've been communication with the local police and we're seeing this guy, who was a very disturbed person,\" he added. The former president has confirmed that he will give a \"victim statement\" to the FBI. During the rest of the interview, he reiterated familiar campaign themes, claiming that Joe Biden's departure from the Democratic 2024 ticket was due to a â\u0080\u009ccoupâ\u0080\u009d and criticising Kamala Harris as a \"weaker and more radical candidate than Biden\". Trump however also mentioned that he would \"probably\" end up debating Harris, despite his campaign hinting at backing out of the debates.",
    "articleSummary": "Former US President Donald Trump narrowly survived a shot at his life during a Pennsylvania rally on July 13. He revealed that the former first lady Melania Trump was watching it live and was left traumatized so much so that she still struggles to talk about the day he dropped to the ground. Trump said that the shooting will not force him to stop holding outside rallies."
  },
  "https://timesofindia.indiatimes.com/india/howrah-mumbai-mail-derailed-in-jharkhand-two-dead-18-injured/articleshow/112126272.cms": {
    "name": "Howrah-Mumbai Mail derailed in Jharkhand, two dead, 18 injured",
    "articleBody": "RANCHI: At least two passengers on board the 12810 Howrah-Mumbai Mail were killed and 18 others were injured after multiple coaches derailed in between Rajkharsawan and Barabamboo railway stations in Jharkhandâ\u0080\u0099s West Singhbhum district in the early hours of Tuesday. The train had departed from Howrah on Monday evening.A medical team of the Chakrdharpur division of South Eastern Railways (SER) has reached the site of the accident. â\u0080\u009cThe injured have been brought to the Chakradharpur railway hospital and are being treated,â\u0080\u009d railway officials said. â\u0080\u009cAs many as two passengers were killed and 18 others were injured in the incident,â\u0080\u009d West Singhbhum deputy commissioner Kuldeep Choudhary told PTI.The Jharkhand government said the trainâ\u0080\u0099s coaches derailed around 3:45 am as most of the passengers were asleep. â\u0080\u009cBoth the deceased passengers were male and were on board the AC three tier coach B4,â\u0080\u009d the state government said in a statement. Of the derailed coaches of the train, 16 were passenger coaches, one power car, and a pantry car. Choudhary said relief train and ambulance had ferried 80 passengers to the Chakradhapur railway hospital for treatment.Mukesh Kumar Lunayat, SP Seraikela-Kharsawan, said the information was first relayed to the Amda police outpost close to the accident site. â\u0080\u009cThe injured were hospitalised within one hour of the accident. Reinforcement of police personnel have been called from Jamshedpur as well,â\u0080\u009d he said. While railway officials did not formally elaborate on the causes which led to the derailment, sources claimed that the mishap occurred after the trainâ\u0080\u0099s engine collided with a few freight boxes of a freight train which had derailed on the down line sometime ago. â\u0080\u009cThe derailed coaches of the freight train had come onto the upline in which the Mumbai mail was running,â\u0080\u009d an eyewitness said. The accident halted railway traffic on the all important Howrah-Mumbai rail route and several long-distance trains such as the Howrah-Titlagarh-Kantabanji Ispat Express and the Howrah-Barbil Janshatabdi Express. Several trains were diverted.The railways said it set up help desks at Howrah, Kharagpur, Jamshedpur, Ranchi, Jharsuguda, Rourkela and other stations and released helpline numbers for Nagpur, Bhusawal and Mumbai. The helpline numbers are 022-22694040 for Mumbai, 08799982712 for Bhusawal, 7757912790 for Nagpur, 0657-2290324 for Tata, 06587-238072 for Chakradharpur, 0661-2501072 and 0661-2500244 for Rourkela and 06645-272530 for Jharsuguda, the SER said in a statement.Helpline numbers for Howrah are 9433357920 and 033-26382217, and for Shalimar are 7595074427 and 6295531471 and for Kharagpur is 03222-293764. West Bengal CM Mamata Banerjee slammed the Indian Railways and the Narendra Modi government for the latest string of railway incidents in recent months. â\u0080\u009cAnother disastrous rail accident! Howrah- Mumbai mail derails in Chakradharpur division in Jharkhand today early morning, multiple deaths and huge number of injuries are the tragic consequences. I seriously ask: is this governance? This series of nightmares almost every week, this unending procession of deaths and injuries on railway tracks: for how long shall we tolerate this? Will there be no end to the callousness of Government of India?! My heart goes out to the bereaved families, condolences to the next of kin,â\u0080\u009d Banerjee wrote on X.",
    "articleSummary": "Multiple coaches derailed in between Rajkharsawan and Barabamboo railway stations in Jharkhand’s West Singhbhum district. At least two passengers on board the 12810 Howrah-Mumbai Mail were killed and 18 others were injured. The train had departed from Howrah on Monday evening."
  },
  "https://timesofindia.indiatimes.com/city/delhi/arvind-kejriwal-had-direct-role-in-excise-scam-cbi-chargesheet/articleshow/112122630.cms": {
    "name": "Arvind Kejriwal had direct role in excise â\u0080\u0098scamâ\u0080\u0099: CBI chargesheet",
    "articleBody": "NEW DELHI: CBI on Monday submitted a comprehensive 200-page chargesheet against chief minister Arvind Kejriwal and five others after completing its probe into the alleged irregularities in the framing and implementation of Delhi Excise Policy 2021-22. The development took place 712 days after the agency had registered an FIR in the case and commenced its investigation. 112122673CBI also pressed charges against AAP MLA MLA Durgesh Pathak, Aurobindo Pharma's non-executive director Sarath Reddy, director of Buddy Retail Amit Arora, entrepreneur Ashish Mathur and hawala operator Vinod Chauhan without apprehending them.Asserting that the CM facilitated the irregularities by being the apex authority, CBI has alleged his direct involvement in the \"scam\" by claiming that he personally handed over the \"draft GOM\" (group of ministers) policy report at his residence to DANICS officer C Arvind. The IAS officer, who also served as secretary to former deputy CM Sisodia, has provided a judicial statement affirming that the report was given to him in March 2021 after Sisodia summoned him to the CM's residence. Final Chargesheet Has 'New Evidence'  The draft GoM report was the new excise policy that was allegedly manipulated to benefit the liquor cartel. The DANICS officer had also testified that AAP's communication in-charge, Vijay Nair, had brought a copy of the excise policy to be fed into a computer while Kejriwal was present there. 112122721The final chargesheet also contains new evidence, including mention of details from an iCloud account, sources said. The chargesheet alleges that K Kavitha, a Bharat Rashtra Samithi MP, and liquor businessman Magunta Reddy convened with Kejriwal on March 16, 2021, in his office at Delhi Secretariat. The chargesheet asserts that during this meeting, Reddy sought Kejriwal's support for his liquor business in Delhi by requesting modifications to the Delhi Excise Policy 2021-22 that was in the works.The chargesheet claims that Kejriwal pledged his support to Reddy and directed him to contact the accused, Kavitha, who was collaborating with his team on the formulation of the excise policy. CBI further alleges that Kejriwal instructed Reddy to provide financial contributions to his party, AAP.The central agency's chargesheet also mentions that certain individuals involved in the liquor business in south India paid advance kickbacks amounting to approximately Rs 100 crore to AAP politicians and other public servants through the co-accused. These kickbacks were allegedly paid to facilitate beneficial changes in the excise policy of 2021-22.The agency has claimed these kickbacks were subsequently returned to some conspirators from the South lobby out of the profit margins of wholesalers holding L-1 licences through various means, including the issuance of excess credit notes, bank transfers and outstanding amounts left in accounts of controlled companies.Additionally, CBI has alleged that a cartel was formed between the three stakeholders of the now-scrapped excise policy - liquor manufacturers, wholesalers and retailers - by violating provisions. The chargesheet emphasises that all the conspirators actively participated in achieving the illegal objectives of the said criminal conspiracy, resulting in substantial losses to the exchequer and undue benefits to the involved public servants and other accused parties.Citing statements of individuals engaged in campaign activities of AAP during the Goa elections, the agency has claimed that cash payments were made to them for roles like that of survey workers, area managers and assembly managers. These individuals and campaign-related activities were collectively managed by Vijay Nair, who has been arrested in this case, and Durgesh Pathak, an AAP MLA, who has also been charged by CBI.Hyderabad-based businessman Sarath Chandra Reddy was arrested by ED in November 2022. He turned approver in the case in June 2023 after he was granted bail on medical grounds. He has been charged too.Kejriwal was arrested by CBI on June 26 from Tihar Jail while he was lodged in judicial custody in a connected money laundering case filed by ED. He was arrested by ED on March 21 but was recently granted bail by a trial court in the money laundering case on June 20. However, the trial court's order was stayed by the high court. On July 12, Supreme Court granted interim bail to Kejriwal in the ED case.The excise policy was scrapped in 2022 after the Delhi LG ordered a CBI probe into alleged irregularities and corruption in the formulation and execution of the policy.",
    "articleSummary": "Citing statements of individuals engaged in campaign activities of AAP during the Goa elections, the agency has claimed that cash payments were made to them for roles like that of survey workers, area managers and assembly managers. These individuals and campaign-related activities were collectively managed by Vijay Nair and Durgesh Pathak, an AAP MLA, who has also been charged by CBI. CBI also pressed charges against AAP MLA MLA Durgesh Pathak, Aurobindo Pharma's non-executive director Sarath Reddy, director of Buddy Retail Amit Arora and entrepreneur Ashish Mathur. The development took place 712 days after the agency had registered an FIR in the case and commenced its investigation."
  },
  "https://timesofindia.indiatimes.com/city/mumbai/navi-mumbai-woman-murder-accused-dawood-arrested-from-karnatakas-gulbarga/articleshow/112124220.cms": {
    "name": "Navi Mumbai murder: Dawood, who killed Yashashri Shinde, brutalised her body, held from Karnataka",
    "articleBody": "NAVI MUMBAI: The Maharashtra crime branch on Tuesday arrested Dawood Shaikh, who allegedly stabbed 20-year-old Yashashri Shinde to death and dumped her body on the roadside in Navi Mumbai's Uran area.He was arrested from his hometown Gulbarga in Karnataka. The police had formed eight teams to launch a manhunt to nab Dawood.A crime branch officer, privy to the case, Dawood confessed that he killed Yashashri Shinde as she had rejected advances several years ago and suspected that she was in a relationship with another youth.Yashashri's missing complaint was lodged by her father late on Thursday. She was found murdered on the isolated road near a petrol pump at Kotnaka in Uran taluka on Friday evening. Her body was found lying in a pool of blood due to multiple stabbing injuries on her waist and back.Yashashri was a commerce graduate and was working at a private company as a data entry operator. On Thursday morning, she had left home by informing her parents that she was going to her friend's house. As she did not return home till late night, her father lodged her missing complaint.On Friday night, a police officer of the detection branch at Uran police station received a call informing that a girl was lying in a pool of blood on the road at Kotnaka and stray dogs were nibbling her body. A police team found the girl's face was disfigured due to nibbling by stray dogs, who had even eaten her shoulder flesh. There were three stab injuries on her waist and back.Her family members, who had lodged a missing personâ\u0080\u0099s complaint on Thursday, identified the body. Her parents had lodged a molestation case against Dawood Shaikh in 2019. Dawood Shaikh is a bus conductor with Karnataka state road transport agency.",
    "articleSummary": "Dawood Shaikh arrested from his hometown Gulbarga in Karnataka. He confessed that he killed Yashashri Shinde as she had rejected advances several years ago. He suspected that she was in a relationship with another youth."
  },
  "https://timesofindia.indiatimes.com/tv/news/hindi/shoaib-ibrahims-father-reacts-to-the-rumours-of-him-participating-in-bigg-boss-18-says-tum-nahi-kar-paoge/articleshow/112125800.cms": {
    "name": "Shoaib Ibrahim's father reacts to the rumours of him participating in Bigg Boss 18, says 'Tum nahi kar paoge'",
    "articleBody": "The countdown to the newest season of Bigg Boss, India's most popular reality TV show, has begun, and fans are hungry for updates on the upcoming controversial season. Bigg Boss and Salman Khan are inseparable, and no one can host the show like him. He not only advises the participants but also corrects them as necessary. To the delight of fans, the megastar has been announced to host the show's eighteenth season.If speculations are to be believed, Shoaib Ibrahim was making news as the first confirmed Bigg Boss 18 candidate. However, Dipika Kakar has taken to her vlog to announce that Shoaib would not be participating in the show. Now, Shoaib also took to his vlog to share his father's reaction to the speculations.Shoaib's father said, \"You should go but then you should know how to fight.\" Shoaib asked that people fight in the show, and his father said, \"But you wouldn't do that, you should fight with them.\" Shoaib then asked that if people fought with him inside the house then, he replied, \"Isiliye toh bekaar hai Bigg Boss, nahi toh fir khamosh raho. Thoda bohot chalega.\" Shoaib then asked whether the show was right for him, and his father replied, \"Bigg Boss tum nahi kar paoge. Tum tez nahi ho, seedhe ho.\" Shoaib then asked that is Dipika smart then as she won the show, his father replied, \"Woh khamosh hai.\" Earlier Shoaib had shared in Dipika's vlog, \"I have mentioned this before as well, never say never but there are no plans of mine to participate in this season of Bigg Boss. I would love to participate but in 3-4 years, not right now. I just wanted to clear it out as I have received so many messages since morning. I don't know who started this news but it isn't happening.\" 107920774112093652111987716He also mentioned that almost lost a project due to the rumours, \"I even received a message from a production house asking whether I was actually going as they were planning to cast me for a show. Then I told them that I wasn't participating and we could talk about the show.\" ",
    "articleSummary": "Shoaib Ibrahim was making news as the first confirmed Bigg Boss 18 candidate. Dipika Kakar has taken to her vlog to announce that Shoaib would not be participating in the show."
  },
  "https://timesofindia.indiatimes.com/sports/cricket/india-in-sri-lanka/virat-kohli-arrives-in-sri-lanka-delights-fans-with-memorable-photo-moments-watch/articleshow/112123274.cms": {
    "name": "Virat Kohli arrives in Sri Lanka, delights fans with memorable photo moments - Watch",
    "articleBody": "NEW DELHI: India's star batsman Virat Kohli arrived in Colombo on Monday ahead of the three-match ODI series against Sri Lanka. The Sri Lankan airport staff and fans welcomed him warmly and took the opportunity to snap some photos with the celebrated cricketer.Kohli, who retired from T20Is following India's victory in the 2024 T20 World Cup, will now focus on ODIs and Tests.The rest of the Indian squad will join captain Rohit Sharma and the ODI players after the final T20I in Pallekele on July 30.India's ODI and Test captain Rohit Sharma has reached Colombo for the ODI series. Besides, Virat, Shreyas Iyer, Kuldeep Yadav, and Harshit Rana checked into the ITC Ratnadipa hotel in the Sri Lankan capital.WATCH:&mdash; KohliSensation (@KohliSensation) With India having already clinched the T20I series by winning the first two matches, attention now turns to the ODIs.The ODI series will kick off on August 2 in Colombo, with all three matches set to be played at the R Premadasa International Cricket Stadium. The second ODI is scheduled for August 4, and the series will conclude on August 7.",
    "articleSummary": "India's star batsman Virat Kohli arrived in Colombo on Monday ahead of the three-match ODI series against Sri Lanka. The Sri Lankan airport staff and fans welcomed him warmly and took the opportunity to snap some photos with the celebrated cricketer."
  },
  "https://timesofindia.indiatimes.com/sports/paris-olympics-2024/paris-olympics-mens-triathlon-postponed-due-to-high-pollution-levels-in-seine/articleshow/112124337.cms": {
    "name": "Paris Olympics: Men's triathlon postponed due to high pollution levels in Seine",
    "articleBody": "The men's triathlon at the Paris Olympics, initially planned for Tuesday, has been postponed due to high pollution levels in the Seine, according to World Triathlon. The race has been moved to Wednesday at 10:45 a.m. (0845 GMT), following the women's event scheduled for the same day at 8 a.m. This decision, prompted by health concerns, introduces uncertainty for the athletes and organizers.Organizers hoped for improved water quality after recent rains last Friday and Saturday had caused contamination in the river. Despite some improvement, World Triathlon reported that water quality in parts of the swim course remained above acceptable levels. Live Updates: Paris Olympics Day 4\"Despite the improvement of water quality levels over the last hours, the readings at some points of the swim course are still above the acceptable limits,\" World Triathlon was quoted by Reuters early on Tuesday. \"Paris 2024 and World Triathlon reiterate that their priority is the health of the athletes.\"If bacterial contamination remains high by Wednesday morning, both the men's and women's races may be further postponed to Friday, earmarked as the contingency day. Should water quality still be a concern on Friday, the swim leg will be removed, and the event will be converted into a duathlon. The mixed triathlon relay event, planned for August 5, has August 6 as its backup day.&mdash; worldtriathlon (@worldtriathlon) The Paris authorities have invested 1.4 billion euros ($1.51 billion) in wastewater infrastructure to mitigate sewage discharge into the Seine. This initiative aims to make the river swimmable, positioning it as a notable legacy of the Games. Earlier this month, Paris Mayor Anne Hidalgo even swam in the river to assure skeptics of its improved safety.Nonetheless, predicting water quality on race day has remained a challenge due to its variable nature. Rainfall significantly increases the levels of harmful bacteria such as E. coli and enterococci in the river. Seth Rider, one of the 55 triathletes entered in the men's race, described his unique preparation for potential bacteria exposure. \"We know that there's going to be some E. coli exposure, so I just try to increase my E. coli threshold by exposing myself to a bit of E. coli in your day-to-day life,\" the U.S. athlete said at a press conference on Saturday.The Olympic triathlon course was designed to showcase Paris's landmarks, with the Seine swim being a key feature. Athletes will begin the swimming segment from a pontoon next to the Alexandre III bridge. They will then cycle and run past iconic sites such as the MusÃ©e d'Orsay and Grand Palais, finishing the race back at the starting point. Competitors crossing the finish line on the bridge will be framed by the stone columns topped with gilt-bronze statues of Pegasus, with the golden dome of the Invalides monument providing a majestic background.",
    "articleSummary": "The men's triathlon at the Paris Olympics has been postponed due to high pollution levels in the Seine. The race has been moved to Wednesday at 10:45 a.m. (0845 GMT), following the women's event scheduled for the same day. Organizers hoped for improved water quality after recent rains last Friday and Saturday had caused contamination."
  },
  "https://timesofindia.indiatimes.com/world/us/ahem-google-kamala-harris-headlines-in-trump-searches-what-elon-musk-said/articleshow/112122022.cms": {
    "name": "'Ahem Google!': Kamala Harris headlines in Trump searches? What Elon Musk said",
    "articleBody": "Elon Musk on Tuesday called out Google for showing results on Kamala Harris when searched Donald Trump. This comes a day after he raised questions regarding absence of search results on Donald Trump's assassination bid. The Tesla CEO shared a few posts on X where users raised concerns about ending up on news related to US presidential candidate Kamala Harris when searched for Donald Trump.\"I did a Google News search about 'Donald Trump'. Google News changed it to 'Harris, Donald Trump' and proceeded to show me only news that favors Harris over Donald Trump,\" a user said on X sharing a screenshot of the search results. &mdash; WallStreetSilv (@WallStreetSilv) 'News about Elon Musk' now when searched Donald TrumpAfter the news organisations picked up the news, the search results changed \"news about\" results to Elon Musk. 112122145'Wow, this is crazy!'Calling it \"crazy\", Musk hinted that the search engine might be censoring the news related to Donald Trump in the run up to US presidential elections scheduled to be held in November.Musk shared another post by a user who claimed that Google was showing only \"positive\" prompts for \"why censorship is\" searches. Sharing a screenshot, the user said, \"When you type 'why censorship is' into Google search, the majority of suggestions are pro-censorship.\"&mdash; TheRabbitHole84 (@TheRabbitHole84) 'Google controlled by Democrats'The Starlink CEO on Monday shared a few posts by users saying that Google was not showing results on Donald Trump's assassination bid that left his right ear injured.Reacting to a user's post that said, \"Google was controlled was by Democrats,\" Musk said, \"Theyâ\u0080\u0099re getting themselves into a lot of trouble if they interfere with the election.\"Google, however, responded to the claim saying that no \"manual actions\" were used to alter search predictions. The search engine's spokesperson told Fox News that it is designed to \"help people save time\" while letting users search for anything they want.",
    "articleSummary": "Elon Musk called out Google for showing results on Kamala Harris when searched Donald Trump. This comes a day after he raised questions regarding absence of search results on Donald Trump's assassination bid. Musk hinted that the search engine might be censoring news related to Donald Trump in the run up to US presidential elections scheduled to be held in November."
  },
  "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-bse-sensex-nifty50-july-30-2024-dalal-street-indian-equities-global-markets/articleshow/112124035.cms": {
    "name": "Stock market today: BSE Sensex, Nifty50 see record closing highs",
    "articleBody": "Stock market today: The BSE Sensex and NSE Nifty closed at record high levels on Tuesday, extending their gains for the third consecutive day, primarily driven by buying in Tata Motors and HDFC Bank. The Sensex closed at 81,455.40, up by 99.56 points or 0.12 per cent, with 16 of its components advancing and 14 ending lower. The index opened higher and surged 459.43 points or 0.56 per cent to reach an intra-day high of 81,815.27.Similarly, the Nifty edged up 21.20 points or 0.09 per cent to settle at an all-time closing high of 24,857.30. During the day, it jumped 135.65 points or 0.54 per cent.Vinod Nair, Head of Research, Geojit Financial Services, commented, \"The domestic market ended flat, due to profit-booking at higher levels. However, the expectation of dovish comments from the US Fed and BoE in the upcoming policy meetings this week is supporting the optimism.\"The combined market valuation of all BSE-listed companies reached the USD 5.50-trillion milestone for the first time, despite heavy volatility. Tata Motors, NTPC, Bajaj Finserv, Power Grid Corp, Titan, Asian Paints, IndusInd Bank, Maruti Suzuki India, and Tata Steel were among the top gainers in the Sensex pack, while Sun Pharmaceuticals, ITC, Hindustan Unilever, Bharti Airtel, UltraTech Cement, and Reliance Industries were among the laggards.Asian markets, including Seoul, Tokyo, Shanghai, and Hong Kong, closed in the negative territory, while European markets were trading on a mixed note. The US markets closed higher on Monday. Brent crude, the global oil benchmark, declined 0.05 per cent to USD 79.73 a barrel. Foreign Institutional Investors (FIIs) offloaded equities worth Rs 2,474.54 crore on Monday, according to exchange data.",
    "articleSummary": "The Sensex closed at 81,455.40, up by 99.56 points or 0.12 per cent. The Nifty edged up 21.20 points to settle at an all-time closing high of 24,857.30. The combined market valuation of all BSE-listed companies reached the USD 5.50-trillion milestone for the first time."
  },
  "https://timesofindia.indiatimes.com/sports/cricket/news/when-venkatapathy-raju-and-javagal-srinath-ran-five-runs-off-one-ball-against-australia-in-adelaide-watch/articleshow/112123395.cms": {
    "name": "When Venkatapathy Raju and Javagal Srinath ran five runs off one ball against Australia in Adelaide - Watch",
    "articleBody": "NEW DELHI: On Sunday, an extraordinary and rare incident unfolded on Day 4 of the one-off Test between Ireland and Zimbabwe at the Civil Service Cricket Club in Belfast. Ireland batters Lorcan Tucker and Andy McBrine completed an all-run five during their team's second innings, sparking widespread excitement on social media.The video of this unusual feat quickly went viral, reminding cricket fans of a similar incident from 1992. Thirty two years ago, in a match between India and Australia at the Adelaide Oval, India's No.10 and No.11 batters, Venkatapathy Raju and Javagal Srinath, also achieved an all-run five, a moment that has now resurfaced and captivated audiences once again.In the recent Ireland vs Zimbabwe match, Ireland was chasing a target of 158 and found themselves in a dire situation at 21/5 inside six overs. Tucker (56) and McBrine (55*) combined to lift Ireland to victory. The rare all-run five occurred in the 18th over when McBrine punched a delivery from Zimbabwe's left-arm seamer Richard Ngarava through the covers. Zimbabwe fielder Tendai Chatara chased the ball and managed to stop it just inside the ropes.WATCH: &mdash; cricketireland (@cricketireland)  Despite his effort, Tucker and McBrine showcased remarkable running between the wickets, completing five runs. This exceptional play contributed significantly to Ireland's recovery and eventual four-wicket victory, with McBrine remaining unbeaten on 55.The viral video of this incident brought to mind the 1992 match between India and Australia at the Adelaide Oval. During Indiaâ\u0080\u0099s first innings, Srinath drove a pitch-up delivery from Australia's fast bowler Craig McDermott through the off-side. Allan Border, fielding at mid-off, chased the ball as it raced towards the boundary. Border managed to save the boundary, but the Indian tailenders Raju and Srinath ran five, marking a rare achievement in cricket history.WATCH:&mdash; CricketopiaCom (@CricketopiaCom) The resurgence of these videos has created a buzz on social media platforms, with fans and analysts reminiscing about these remarkable moments. These incidents, separated by decades, highlight the spirit of cricket and the unforgettable moments that make the sport beloved by millions worldwide.",
    "articleSummary": "Ireland batters Lorcan Tucker and Andy McBrine completed an all-run five during their team's second innings, sparking widespread excitement on social media. The video of this unusual feat quickly went viral, reminding cricket fans of a similar incident from 1992. Thirty two years ago, in a match between India and Australia at the Adelaide Oval, India's No.10 and No.11 batters, Venkatapathy Raju and Javagal Srinath, also achieved a rare achievement. These incidents, separated by decades, highlight the spirit of cricket."
  }
}